cmsis-svd/cmsis-svd/data/Infineon/TLE9879-2.svd
<?xml version="1.0" encoding="UTF-8" standalone="yes"?>
<!-- edited with XMLSpy v2017 rel. 3 (http://www.altova.com) by Infineon Technologies (Infineon Technologies AG) -->
<!--Version of used XSLT processor: 2.0 Altova GmbH http://www.altova.com-->
<!--Version of used XSLT: ISFR2SVD.xslt  V0.10-->
<!--Configuration of XSLT: with bit extraction =Yes;  with bit coding =Yes; decodeThe3knownBitAccessTypes = Yes; 0,r and 1,r bit extraction = No-->
<!--Version of used XSLT for fixing SVD issues: SVD_fixes.xslt  V1.4-->
<device xmlns:xs="http://www.w3.org/2001/XMLSchema-instance" schemaVersion="1.2" xs:noNamespaceSchemaLocation="CMSIS-SVD_Schema_1_2.xsd">
	<vendor>Infineon</vendor>
	<name>TLE987x</name>
	<version>3.8</version>
	<description>TLE987x Family</description>
	<cpu>
		<name>CM3</name>
		<revision>r0p0</revision>
		<endian>little</endian>
		<mpuPresent>false</mpuPresent>
		<fpuPresent>false</fpuPresent>
		<nvicPrioBits>4</nvicPrioBits>
		<vendorSystickConfig>false</vendorSystickConfig>
	</cpu>
	<addressUnitBits>8</addressUnitBits>
	<width>32</width>
	<peripherals>
		<peripheral>
			<name>ADC1</name>
			<description>ADC1 Module</description>
			<baseAddress>0x40004000</baseAddress>
			<addressBlock>
				<offset>0x0</offset>
				<size>0x4000</size>
				<usage>registers</usage>
			</addressBlock>
			<interrupt>
				<name>ADC1_VREF5_Int</name>
				<description>Interrupt node 3: ADC1, VAREF</description>
				<value>3</value>
			</interrupt>
			<registers>
				<register>
					<name>CHx_EIM</name>
					<description>Channel Settings Bits for Exceptional Interrupt Measurement</description>
					<addressOffset>0x08</addressOffset>
					<size>32</size>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>TRIG_SEL</name>
							<description>Trigger selection for exceptional interrupt measurement (EIM)</description>
							<lsb>16</lsb>
							<msb>18</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>NONE</name>
									<description>.</description>
									<value>0b000</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>COUT63</name>
									<description>.</description>
									<value>0b001</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>GPT12_T6OUT</name>
									<description>.</description>
									<value>0b010</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>GPT12_T3OUT</name>
									<description>.</description>
									<value>0b011</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>T2</name>
									<description>t2_adc_trigger</description>
									<value>0b100</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>T21</name>
									<description>t21_adc_trigger</description>
									<value>0b101</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CCU_6_INT</name>
									<description>ccu6_int</description>
									<value>0b110</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>REP</name>
							<description>Repeat count for exceptional interrupt measurement (EIM)</description>
							<lsb>4</lsb>
							<msb>6</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>1</name>
									<description>Measurement</description>
									<value>0b000</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>2</name>
									<description>Measurements</description>
									<value>0b001</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>4</name>
									<description>Measurements</description>
									<value>0b010</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>8</name>
									<description>Measurements</description>
									<value>0b011</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>16</name>
									<description>Measurements</description>
									<value>0b100</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>32</name>
									<description>Measurements</description>
									<value>0b101</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>64</name>
									<description>Measurements</description>
									<value>0b110</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>128</name>
									<description>Measurements</description>
									<value>0b111</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>CHx</name>
							<description>Channel set for exceptional interrupt measurement (EIM)</description>
							<lsb>0</lsb>
							<msb>2</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>CH0_EN</name>
									<description>Channel 0 enable</description>
									<value>0b000</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CH1_EN</name>
									<description>Channel 1 enable</description>
									<value>0b001</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CH2_EN</name>
									<description>Channel 2 enable</description>
									<value>0b010</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CH3_EN</name>
									<description>Channel 3 enable</description>
									<value>0b011</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CH4_EN</name>
									<description>Channel 4 enable</description>
									<value>0b100</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CH5_EN</name>
									<description>Channel 5 enable</description>
									<value>0b101</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CH6_EN</name>
									<description>Channel 6 enable</description>
									<value>0b110</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CH7_EN</name>
									<description>Channel 7 enable</description>
									<value>0b111</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>CHx_ESM</name>
					<description>Channel Settings Bits for Exceptional Sequence Measurement</description>
					<addressOffset>0x0C</addressOffset>
					<size>32</size>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>TRIG_SEL</name>
							<description>Trigger selection for exceptional interrupt measurement (ESM)</description>
							<lsb>16</lsb>
							<msb>18</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>NONE</name>
									<description>.</description>
									<value>0b000</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>COUT63</name>
									<description>.</description>
									<value>0b001</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>GPT12_T6OUT</name>
									<description>.</description>
									<value>0b010</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>GPT12_T3OUT</name>
									<description>.</description>
									<value>0b011</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>T2</name>
									<description>t2_adc_trigger</description>
									<value>0b100</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>T21</name>
									<description>t21_adc_trigger</description>
									<value>0b101</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CCU_6_INT</name>
									<description>ccu6_int</description>
									<value>0b110</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>ESM_0</name>
							<description>Channel Sequence for Exceptional Sequence Measurement (ESM)</description>
							<lsb>0</lsb>
							<msb>7</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>CTRL_STS</name>
					<description>ADC1 Control and Status Register</description>
					<addressOffset>0x00</addressOffset>
					<size>32</size>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>IN_MUX_SEL</name>
							<description>Channel for software mode</description>
							<lsb>4</lsb>
							<msb>6</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>CH0_EN</name>
									<description>Channel 0 enable</description>
									<value>0b000</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CH1_EN</name>
									<description>Channel 1 enable</description>
									<value>0b001</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CH2_EN</name>
									<description>Channel 2 enable</description>
									<value>0b010</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CH3_EN</name>
									<description>Channel 3 enable</description>
									<value>0b011</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CH4_EN</name>
									<description>Channel 4 enable</description>
									<value>0b100</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CH5_EN</name>
									<description>Channel 5 enable</description>
									<value>0b101</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CH6_EN</name>
									<description>Channel 6 enable</description>
									<value>0b110</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CH7_EN</name>
									<description>Channel 7 enable</description>
									<value>0b111</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>EOC</name>
							<description>ADC1 End of Conversion (software mode)</description>
							<lsb>3</lsb>
							<msb>3</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>Pending</name>
									<description>conversion still running</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Finished</name>
									<description>conversion has finished</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>SOC</name>
							<description>ADC1 Start of Conversion (software mode)</description>
							<lsb>2</lsb>
							<msb>2</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>Disable</name>
									<description>no conversion is started</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Enable</name>
									<description>conversion is started</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>PD_N</name>
							<description>ADC1 Power Down Signal</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>POWER_DOWN</name>
									<description>ADC1 is powered down</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ACTIVE</name>
									<description>ADC1 is switched on</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>DWSEL</name>
					<description>Measurement Channel Data Width Selection</description>
					<addressOffset>0x24</addressOffset>
					<size>32</size>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>ch7</name>
							<description>Data Width channel 7</description>
							<lsb>7</lsb>
							<msb>7</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>10BIT</name>
									<description>The result is 10 bits wide (bits 11 .. 2)</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>8BIT</name>
									<description>The result is 8 bits wide (bits 9 .. 4)</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>ch6</name>
							<description>Data Width channel 6</description>
							<lsb>6</lsb>
							<msb>6</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>10BIT</name>
									<description>The result is 10 bits wide (bits 11 .. 2)</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>8BIT</name>
									<description>The result is 8 bits wide (bits 9 .. 4)</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>ch5</name>
							<description>Data Width channel 5</description>
							<lsb>5</lsb>
							<msb>5</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>10BIT</name>
									<description>The result is 10 bits wide (bits 11 .. 2)</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>8BIT</name>
									<description>The result is 8 bits wide (bits 9 .. 4)</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>ch4</name>
							<description>Data Width channel 4</description>
							<lsb>4</lsb>
							<msb>4</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>10BIT</name>
									<description>The result is 10 bits wide (bits 11 .. 2)</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>8BIT</name>
									<description>The result is 8 bits wide (bits 9 .. 4)</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>ch3</name>
							<description>Data Width channel 3</description>
							<lsb>3</lsb>
							<msb>3</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>10BIT</name>
									<description>The result is 10 bits wide (bits 11 .. 2)</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>8BIT</name>
									<description>The result is 8 bits wide (bits 9 .. 4)</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>ch2</name>
							<description>Data Width channel 2</description>
							<lsb>2</lsb>
							<msb>2</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>10BIT</name>
									<description>The result is 10 bits wide (bits 11 .. 2)</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>8BIT</name>
									<description>The result is 8 bits wide (bits 9 .. 4)</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>ch1</name>
							<description>Data Width channel 1</description>
							<lsb>1</lsb>
							<msb>1</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>10BIT</name>
									<description>The result is 10 bits wide (bits 11 .. 2)</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>8BIT</name>
									<description>The result is 8 bits wide (bits 9 .. 4)</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>ch0</name>
							<description>Data Width channel 0</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>10BIT</name>
									<description>The result is 10 bits wide (bits 11 .. 2)</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>8BIT</name>
									<description>The result is 8 bits wide (bits 9 .. 4)</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>GLOBCTR</name>
					<description>Global Control Register</description>
					<addressOffset>0x04</addressOffset>
					<size>32</size>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>ANON</name>
							<description>Analog Part Switched On</description>
							<lsb>8</lsb>
							<msb>9</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>OFF</name>
									<description>ADC1 switched off</description>
									<value>0b00</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>S_STANDBY</name>
									<description>Slow standby mode</description>
									<value>0b01</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>F_STANDBY</name>
									<description>Fast standby mode</description>
									<value>0b10</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>NORMAL</name>
									<description>Normal Operation</description>
									<value>0b11</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>DIVA</name>
							<description>Divide Factor for the Analog internal clock: 0x00=Fadci = Fadc, 0x01=Fadci = Fadc/2, 0x02=Fadci = Fadc/3, 0x02=..., 0x3F=Fadci = Fadc/64, </description>
							<lsb>0</lsb>
							<msb>5</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>GLOBSTR</name>
					<description>Global Status Register</description>
					<addressOffset>0x74</addressOffset>
					<size>32</size>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>ANON_ST</name>
							<description>Analog Part Switched On</description>
							<lsb>8</lsb>
							<msb>9</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>OFF</name>
									<description>ADC1 switched off</description>
									<value>0b00</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>S_STANDBY</name>
									<description>Slow standby mode</description>
									<value>0b01</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>F_STANDBY</name>
									<description>Fast standby mode</description>
									<value>0b10</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>NORMAL</name>
									<description>Normal Operation</description>
									<value>0b11</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>CHNR</name>
							<description>Channel Number</description>
							<lsb>3</lsb>
							<msb>5</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>SAMPLE</name>
							<description>Sample Phase Indication</description>
							<lsb>1</lsb>
							<msb>1</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>IDLE</name>
									<description>ADC1 is idle or converting</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ACTIVE</name>
									<description>The Input signal is being sampled</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>BUSY</name>
							<description>Analog Part Busy</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>IDLE</name>
									<description>ADC1 idle</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ACTIVE</name>
									<description>ADC1 Conversion is currently running</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
