cmsis-svd/cmsis-svd/data/Infineon/TLE9879-2.svd
				<register>
					<name>SQ_FB</name>
					<description>Sequencer Feedback Register</description>
					<addressOffset>0x50</addressOffset>
					<size>32</size>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>CHx</name>
							<description>Current Channel</description>
							<lsb>16</lsb>
							<msb>18</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>CH0</name>
									<description>Channel 0</description>
									<value>0b000</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CH1</name>
									<description>Channel 1</description>
									<value>0b001</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CH2</name>
									<description>Channel 2</description>
									<value>0b010</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CH3</name>
									<description>Channel 3</description>
									<value>0b011</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CH4</name>
									<description>Channel 4</description>
									<value>0b100</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CH5</name>
									<description>Channel 5</description>
									<value>0b101</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CH6</name>
									<description>Channel 6</description>
									<value>0b110</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CH7</name>
									<description>Channel 7</description>
									<value>0b111</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>SQx</name>
							<description>Current Active Sequence in Sequencer Mode</description>
							<lsb>11</lsb>
							<msb>13</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>SQ0</name>
									<description>Sequence 0</description>
									<value>0b000</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>SQ1</name>
									<description>Sequence 1</description>
									<value>0b001</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>SQ2</name>
									<description>Sequence 2</description>
									<value>0b010</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>SQ3</name>
									<description>Sequence 3</description>
									<value>0b011</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>SQ4</name>
									<description>Sequence 4</description>
									<value>0b100</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>SQ5</name>
									<description>Sequence 5</description>
									<value>0b101</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>SQ6</name>
									<description>Sequence 6</description>
									<value>0b110</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>SQ7</name>
									<description>Sequence 7</description>
									<value>0b111</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>ESM_ACTIVE</name>
							<description>ADC1 ESM active</description>
							<lsb>10</lsb>
							<msb>10</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>not_active</name>
									<description>ESM not active</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>active</name>
									<description>ESM active</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>EIM_ACTIVE</name>
							<description>ADC1 EIM active</description>
							<lsb>9</lsb>
							<msb>9</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>not_active</name>
									<description>EIM not active</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>active</name>
									<description>EIM active</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>SQ_RUN</name>
							<description>ADC1 Sequencer RUN</description>
							<lsb>8</lsb>
							<msb>8</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>SQ_Stopped</name>
									<description>Postprocessing Sequencer in stopped / Software mode</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>SQ_Running</name>
									<description>Postprocessing Sequencer is running</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>STC_0_3</name>
					<description>Measurement Channel Sample Time Control 0 - 3</description>
					<addressOffset>0x28</addressOffset>
					<size>32</size>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>ch3</name>
							<description>Sample Time Control for Channel 3</description>
							<lsb>24</lsb>
							<msb>31</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>ch2</name>
							<description>Sample Time Control for Channel 2</description>
							<lsb>16</lsb>
							<msb>23</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>ch1</name>
							<description>Sample Time Control for Channel 1</description>
							<lsb>8</lsb>
							<msb>15</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>ch0</name>
							<description>Sample Time Control for Channel 0</description>
							<lsb>0</lsb>
							<msb>7</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>STC_4_7</name>
					<description>Measurement Channel Sample Time Control 4 - 7</description>
					<addressOffset>0x2C</addressOffset>
					<size>32</size>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>ch7</name>
							<description>Sample Time Control for Channel 7</description>
							<lsb>24</lsb>
							<msb>31</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>ch6</name>
							<description>Sample Time Control for Channel 6</description>
							<lsb>16</lsb>
							<msb>23</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>ch5</name>
							<description>Sample Time Control for Channel 5</description>
							<lsb>8</lsb>
							<msb>15</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>ch4</name>
							<description>Sample Time Control for Channel 4</description>
							<lsb>0</lsb>
							<msb>7</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
