cmsis-svd/cmsis-svd/data/Infineon/TLE9879-2.svd
				<register>
					<name>CNT0_3_LOWER</name>
					<description>Lower Counter Trigger Level Channel 0 - 3</description>
					<addressOffset>0x98</addressOffset>
					<size>32</size>
					<resetValue>0x12131312</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>HYST_LO_CH3</name>
							<description>Channel 3 lower hysteresis</description>
							<lsb>27</lsb>
							<msb>28</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>HYSTOFF</name>
									<description>hysteresis switched off</description>
									<value>0x0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>HYST4</name>
									<description>hysteresis = 4</description>
									<value>0x1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>HYST8</name>
									<description>hysteresis = 8</description>
									<value>0x2</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>HYST16</name>
									<description>hysteresis = 16</description>
									<value>0x3</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>CNT_LO_CH3</name>
							<description>Lower timer trigger threshold channel 3</description>
							<lsb>24</lsb>
							<msb>26</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>1 measurement</description>
									<value>0x0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>2 measurements</description>
									<value>0x1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value3</name>
									<description>4 measurements</description>
									<value>0x2</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value4</name>
									<description>8 measurements</description>
									<value>0x3</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value5</name>
									<description>16 measurements</description>
									<value>0x4</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value6</name>
									<description>32 measurements</description>
									<value>0x5</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value7</name>
									<description>64 measurements</description>
									<value>0x6</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value8</name>
									<description>128 measurements</description>
									<value>0x7</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>HYST_LO_CH2</name>
							<description>Channel 2 lower hysteresis</description>
							<lsb>19</lsb>
							<msb>20</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>HYSTOFF</name>
									<description>hysteresis switched off</description>
									<value>0x0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>HYST4</name>
									<description>hysteresis = 4</description>
									<value>0x1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>HYST8</name>
									<description>hysteresis = 8</description>
									<value>0x2</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>HYST16</name>
									<description>hysteresis = 16</description>
									<value>0x3</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>CNT_LO_CH2</name>
							<description>Lower timer trigger threshold channel 2</description>
							<lsb>16</lsb>
							<msb>18</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>1 measurement</description>
									<value>0x0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>2 measurements</description>
									<value>0x1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value3</name>
									<description>4 measurements</description>
									<value>0x2</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value4</name>
									<description>8 measurements</description>
									<value>0x3</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value5</name>
									<description>16 measurements</description>
									<value>0x4</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value6</name>
									<description>32 measurements</description>
									<value>0x5</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value7</name>
									<description>64 measurements</description>
									<value>0x6</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value8</name>
									<description>128 measurements</description>
									<value>0x7</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>HYST_LO_CH1</name>
							<description>Channel 1 lower hysteresis</description>
							<lsb>11</lsb>
							<msb>12</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>HYSTOFF</name>
									<description>hysteresis switched off</description>
									<value>0x0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>HYST4</name>
									<description>hysteresis = 4</description>
									<value>0x1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>HYST8</name>
									<description>hysteresis = 8</description>
									<value>0x2</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>HYST16</name>
									<description>hysteresis = 16</description>
									<value>0x3</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>CNT_LO_CH1</name>
							<description>Lower timer trigger threshold channel 1</description>
							<lsb>8</lsb>
							<msb>10</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>1 measurement</description>
									<value>0x0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>2 measurements</description>
									<value>0x1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value3</name>
									<description>4 measurements</description>
									<value>0x2</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value4</name>
									<description>8 measurements</description>
									<value>0x3</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value5</name>
									<description>16 measurements</description>
									<value>0x4</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value6</name>
									<description>32 measurements</description>
									<value>0x5</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value7</name>
									<description>64 measurements</description>
									<value>0x6</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value8</name>
									<description>128 measurements</description>
									<value>0x7</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>HYST_LO_CH0</name>
							<description>Channel 0 lower hysteresis</description>
							<lsb>3</lsb>
							<msb>4</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>HYSTOFF</name>
									<description>hysteresis switched off</description>
									<value>0x0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>HYST4</name>
									<description>hysteresis = 4</description>
									<value>0x1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>HYST8</name>
									<description>hysteresis = 8</description>
									<value>0x2</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>HYST16</name>
									<description>hysteresis = 16</description>
									<value>0x3</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>CNT_LO_CH0</name>
							<description>Lower timer trigger threshold channel 0</description>
							<lsb>0</lsb>
							<msb>2</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>1 measurement</description>
									<value>0x0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>2 measurements</description>
									<value>0x1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value3</name>
									<description>4 measurements</description>
									<value>0x2</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value4</name>
									<description>8 measurements</description>
									<value>0x3</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value5</name>
									<description>16 measurements</description>
									<value>0x4</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value6</name>
									<description>32 measurements</description>
									<value>0x5</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value7</name>
									<description>64 measurements</description>
									<value>0x6</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value8</name>
									<description>128 measurements</description>
									<value>0x7</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>CNT0_3_UPPER</name>
					<description>Upper Counter Trigger Level Channel 0 - 3</description>
					<addressOffset>0xA4</addressOffset>
					<size>32</size>
					<resetValue>0x12131B1A</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>HYST_UP_CH3</name>
							<description>Channel 3 upper hysteresis</description>
							<lsb>27</lsb>
							<msb>28</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>HYSTOFF</name>
									<description>hysteresis switched off</description>
									<value>0x0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>HYST4</name>
									<description>hysteresis = 4</description>
									<value>0x1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>HYST8</name>
									<description>hysteresis = 8</description>
									<value>0x2</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>HYST16</name>
									<description>hysteresis = 16</description>
									<value>0x3</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>CNT_UP_CH3</name>
							<description>Upper timer trigger threshold channel 3</description>
							<lsb>24</lsb>
							<msb>26</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>1 measurement</description>
									<value>0x0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>2 measurements</description>
									<value>0x1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value3</name>
									<description>4 measurements</description>
									<value>0x2</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value4</name>
									<description>8 measurements</description>
									<value>0x3</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value5</name>
									<description>16 measurements</description>
									<value>0x4</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value6</name>
									<description>32 measurements</description>
									<value>0x5</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value7</name>
									<description>64 measurements</description>
									<value>0x6</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value8</name>
									<description>128 measurements</description>
									<value>0x7</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>HYST_UP_CH2</name>
							<description>Channel 2 upper hysteresis</description>
							<lsb>19</lsb>
							<msb>20</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>HYSTOFF</name>
									<description>hysteresis switched off</description>
									<value>0x0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>HYST4</name>
									<description>hysteresis = 4</description>
									<value>0x1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>HYST8</name>
									<description>hysteresis = 8</description>
									<value>0x2</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>HYST16</name>
									<description>hysteresis = 16</description>
									<value>0x3</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>CNT_UP_CH2</name>
							<description>Upper timer trigger threshold channel 2</description>
							<lsb>16</lsb>
							<msb>18</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>1 measurement</description>
									<value>0x0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>2 measurements</description>
									<value>0x1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value3</name>
									<description>4 measurements</description>
									<value>0x2</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value4</name>
									<description>8 measurements</description>
									<value>0x3</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value5</name>
									<description>16 measurements</description>
									<value>0x4</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value6</name>
									<description>32 measurements</description>
									<value>0x5</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value7</name>
									<description>64 measurements</description>
									<value>0x6</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value8</name>
									<description>128 measurements</description>
									<value>0x7</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>HYST_UP_CH1</name>
							<description>Channel 1 upper hysteresis</description>
							<lsb>11</lsb>
							<msb>12</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>HYSTOFF</name>
									<description>hysteresis switched off</description>
									<value>0x0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>HYST4</name>
									<description>hysteresis = 4</description>
									<value>0x1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>HYST8</name>
									<description>hysteresis = 8</description>
									<value>0x2</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>HYST16</name>
									<description>hysteresis = 16</description>
									<value>0x3</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>CNT_UP_CH1</name>
							<description>Upper timer trigger threshold channel 1</description>
							<lsb>8</lsb>
							<msb>10</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>1 measurement</description>
									<value>0x0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>2 measurements</description>
									<value>0x1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value3</name>
									<description>4 measurements</description>
									<value>0x2</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value4</name>
									<description>8 measurements</description>
									<value>0x3</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value5</name>
									<description>16 measurements</description>
									<value>0x4</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value6</name>
									<description>32 measurements</description>
									<value>0x5</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value7</name>
									<description>64 measurements</description>
									<value>0x6</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value8</name>
									<description>128 measurements</description>
									<value>0x7</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>HYST_UP_CH0</name>
							<description>Channel 0 upper hysteresis</description>
							<lsb>3</lsb>
							<msb>4</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>HYSTOFF</name>
									<description>hysteresis switched off</description>
									<value>0x0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>HYST4</name>
									<description>hysteresis = 4</description>
									<value>0x1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>HYST8</name>
									<description>hysteresis = 8</description>
									<value>0x2</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>HYST16</name>
									<description>hysteresis = 16</description>
									<value>0x3</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>CNT_UP_CH0</name>
							<description>Upper timer trigger threshold channel 0</description>
							<lsb>0</lsb>
							<msb>2</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>1 measurement</description>
									<value>0x0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>2 measurements</description>
									<value>0x1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value3</name>
									<description>4 measurements</description>
									<value>0x2</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value4</name>
									<description>8 measurements</description>
									<value>0x3</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value5</name>
									<description>16 measurements</description>
									<value>0x4</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value6</name>
									<description>32 measurements</description>
									<value>0x5</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value7</name>
									<description>64 measurements</description>
									<value>0x6</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value8</name>
									<description>128 measurements</description>
									<value>0x7</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
