cmsis-svd/cmsis-svd/data/Infineon/TLE9879-2.svd
				<register>
					<name>CNT6_9_UPPER</name>
					<description>Upper Counter Trigger Level Channel 6 -9</description>
					<addressOffset>0xAC</addressOffset>
					<size>32</size>
					<resetValue>0x1A1A1911</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>HYST_UP_CH9</name>
							<description>Channel 9 upper hysteresis</description>
							<lsb>27</lsb>
							<msb>28</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>HYSTOFF</name>
									<description>hysteresis switched off</description>
									<value>0x0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>HYST4</name>
									<description>hysteresis = 4</description>
									<value>0x1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>HYST8</name>
									<description>hysteresis = 8</description>
									<value>0x2</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>HYST16</name>
									<description>hysteresis = 16</description>
									<value>0x3</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>CNT_UP_CH9</name>
							<description>Upper timer trigger threshold channel 9</description>
							<lsb>24</lsb>
							<msb>26</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>1 measurement</description>
									<value>0x0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>2 measurements</description>
									<value>0x1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value3</name>
									<description>4 measurements</description>
									<value>0x2</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value4</name>
									<description>8 measurements</description>
									<value>0x3</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value5</name>
									<description>16 measurements</description>
									<value>0x4</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value6</name>
									<description>32 measurements</description>
									<value>0x5</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value7</name>
									<description>64 measurements</description>
									<value>0x6</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value8</name>
									<description>128 measurements</description>
									<value>0x7</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>HYST_UP_CH8</name>
							<description>Channel 8 upper hysteresis</description>
							<lsb>19</lsb>
							<msb>20</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>HYSTOFF</name>
									<description>hysteresis switched off</description>
									<value>0x0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>HYST4</name>
									<description>hysteresis = 4</description>
									<value>0x1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>HYST8</name>
									<description>hysteresis = 8</description>
									<value>0x2</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>HYST16</name>
									<description>hysteresis = 16</description>
									<value>0x3</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>CNT_UP_CH8</name>
							<description>Upper timer trigger threshold channel 8</description>
							<lsb>16</lsb>
							<msb>18</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>1 measurement</description>
									<value>0x0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>2 measurements</description>
									<value>0x1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value3</name>
									<description>4 measurements</description>
									<value>0x2</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value4</name>
									<description>8 measurements</description>
									<value>0x3</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value5</name>
									<description>16 measurements</description>
									<value>0x4</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value6</name>
									<description>32 measurements</description>
									<value>0x5</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value7</name>
									<description>64 measurements</description>
									<value>0x6</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value8</name>
									<description>128 measurements</description>
									<value>0x7</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>HYST_UP_CH7</name>
							<description>Channel 7 upper hysteresis</description>
							<lsb>11</lsb>
							<msb>12</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>HYSTOFF</name>
									<description>hysteresis switched off</description>
									<value>0x0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>HYST4</name>
									<description>hysteresis = 4</description>
									<value>0x1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>HYST8</name>
									<description>hysteresis = 8</description>
									<value>0x2</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>HYST16</name>
									<description>hysteresis = 16</description>
									<value>0x3</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>CNT_UP_CH7</name>
							<description>Upper timer trigger threshold channel 7</description>
							<lsb>8</lsb>
							<msb>10</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>1 measurement</description>
									<value>0x0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>2 measurements</description>
									<value>0x1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value3</name>
									<description>4 measurements</description>
									<value>0x2</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value4</name>
									<description>8 measurements</description>
									<value>0x3</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value5</name>
									<description>16 measurements</description>
									<value>0x4</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value6</name>
									<description>32 measurements</description>
									<value>0x5</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value7</name>
									<description>64 measurements</description>
									<value>0x6</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value8</name>
									<description>128 measurements</description>
									<value>0x7</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>HYST_UP_CH6</name>
							<description>Channel 6 upper hysteresis</description>
							<lsb>3</lsb>
							<msb>4</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>HYSTOFF</name>
									<description>hysteresis switched off</description>
									<value>0x0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>HYST4</name>
									<description>hysteresis = 4</description>
									<value>0x1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>HYST8</name>
									<description>hysteresis = 8</description>
									<value>0x2</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>HYST16</name>
									<description>hysteresis = 16</description>
									<value>0x3</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>CNT_UP_CH6</name>
							<description>Upper timer trigger threshold channel 6</description>
							<lsb>0</lsb>
							<msb>2</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>1 measurement</description>
									<value>0x0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>2 measurements</description>
									<value>0x1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value3</name>
									<description>4 measurements</description>
									<value>0x2</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value4</name>
									<description>8 measurements</description>
									<value>0x3</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value5</name>
									<description>16 measurements</description>
									<value>0x4</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value6</name>
									<description>32 measurements</description>
									<value>0x5</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value7</name>
									<description>64 measurements</description>
									<value>0x6</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value8</name>
									<description>128 measurements</description>
									<value>0x7</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>CTRL1</name>
					<description>Measurement Unit Control Register 1</description>
					<addressOffset>0x14</addressOffset>
					<size>32</size>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>CALIB_EN</name>
							<description>Calibration Enable for Channels 0 to 5</description>
							<lsb>0</lsb>
							<msb>5</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>CH0_EN</name>
									<description>Channel 0 calibration enable</description>
									<value>0b000001</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CH1_EN</name>
									<description>Channel 1 calibration enable</description>
									<value>0b000010</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CH2_EN</name>
									<description>Channel 2 calibration enable</description>
									<value>0b000100</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CH3_EN</name>
									<description>Channel 3 calibration enable</description>
									<value>0b001000</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CH4_EN</name>
									<description>Channel 4 calibration enable</description>
									<value>0b010000</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CH5_EN</name>
									<description>Channel 5 calibration enable</description>
									<value>0b100000</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>CTRL2</name>
					<description>Measurement Unit Control Register 2</description>
					<addressOffset>0x18</addressOffset>
					<size>32</size>
					<resetValue>0x000F0805</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>SAMPLE_TIME_int</name>
							<description>Sample time of ADC2</description>
							<lsb>8</lsb>
							<msb>11</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>MICLK4</name>
									<description>4 MI_CLK clock periods</description>
									<value>0x0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>MICLK6</name>
									<description>6 MI_CLK clock periods</description>
									<value>0x1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>MICLK8</name>
									<description>8 MI_CLK clock periods</description>
									<value>0x2</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>MICLK10</name>
									<description>10 MI_CLK clock periods</description>
									<value>0x3</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>MICLK12</name>
									<description>12 MI_CLK clock periods (default)</description>
									<value>0x4</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>MICLK14</name>
									<description>14 MI_CLK clock periods</description>
									<value>0x5</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>MICLK16</name>
									<description>16 MI_CLK clock periods</description>
									<value>0x6</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>MICLK18</name>
									<description>18 MI_CLK clock periods</description>
									<value>0x7</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>MICLK20</name>
									<description>20 MI_CLK clock periods</description>
									<value>0x8</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>MICLK22</name>
									<description>22 MI_CLK clock periods</description>
									<value>0x9</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>MCM_RDY</name>
							<description>Ready Signal for MCM after Power On or Reset</description>
							<lsb>7</lsb>
							<msb>7</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>MCM_Not_Ready</name>
									<description>Measurement Core Module in startup phase</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>MCM_Ready</name>
									<description>Measurement Core Module start-up phase finished</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>TSENSE_SD_SEL</name>
							<description>Temperature Sensor selection connected to Ch9</description>
							<lsb>2</lsb>
							<msb>2</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>PMU_TSENSE</name>
									<description>PMU Temperature sensor selected</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Central_TSENSE</name>
									<description>Central Temperature Sensor selected</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>TS_SD_SEL_CONF</name>
							<description>Temperature Sensor Control Configuration</description>
							<lsb>1</lsb>
							<msb>1</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>Constant</name>
									<description>Temperature Sensor selection done by bitfield TSENSE_SD_SEL</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Not_Active</name>
									<description>Temperature Sensor selection done by DPP</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>MCM_PD_N</name>
							<description>Power Down Signal for MCM</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>MCM_Disabled</name>
									<description>Measurement Core Module Disabled</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>MCM_Enabled</name>
									<description>Measurement Core Module Enabled</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>CTRL4</name>
					<description>Measurement Unit Control Register 4</description>
					<addressOffset>0x1C</addressOffset>
					<size>32</size>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>FILT_OUT_SEL_9_6</name>
							<description>Output Filter Selection for Channels 6 to 9</description>
							<lsb>8</lsb>
							<msb>11</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>FILT_OUT_SEL_5_0</name>
							<description>Output Filter Selection for Channels 0 to 5</description>
							<lsb>0</lsb>
							<msb>5</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>CTRL_STS</name>
					<description>ADC2 Control and Status Register</description>
					<addressOffset>0x00</addressOffset>
					<size>32</size>
					<resetValue>0x00000001</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>VS_RANGE</name>
							<description>ADC2 Channel 1 Range Selection</description>
							<lsb>17</lsb>
							<msb>17</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>Range1</name>
									<description>Range from 3 to 22 V is selected</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Range2</name>
									<description>Range from 3 to 28 V is selected</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>FILT_LO_CTRL</name>
					<description>Lower Threshold Filter Enable</description>
					<addressOffset>0x7C</addressOffset>
					<size>32</size>
					<resetValue>0x00000F3F</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>Ch5_EN</name>
							<description>Lower threshold IIR filter enable ch 5</description>
							<lsb>5</lsb>
							<msb>5</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>disable</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>enable</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>Ch4_EN</name>
							<description>Lower threshold IIR filter enable ch 4</description>
							<lsb>4</lsb>
							<msb>4</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>disable</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>enable</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>Ch3_EN</name>
							<description>Lower threshold IIR filter enable ch 3</description>
							<lsb>3</lsb>
							<msb>3</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>disable</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>enable</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>Ch2_EN</name>
							<description>Lower threshold IIR filter enable ch 2</description>
							<lsb>2</lsb>
							<msb>2</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>disable</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>enable</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>Ch1_EN</name>
							<description>Lower threshold IIR filter enable ch 1</description>
							<lsb>1</lsb>
							<msb>1</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>disable</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>enable</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>Ch0_EN</name>
							<description>Lower threshold IIR filter enable ch 0</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>disable</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>enable</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>FILT_OUT0</name>
					<description>ADC or Filter Output Channel 0</description>
					<addressOffset>0x50</addressOffset>
					<size>32</size>
					<resetValue>#00000000000000000000000000000000</resetValue>
					<resetMask>#11111111111111111111110000000000</resetMask>
					<fields>
						<field>
							<name>OUT_CH0</name>
							<description>ADC or filter output value channel 0</description>
							<lsb>0</lsb>
							<msb>9</msb>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>FILT_OUT1</name>
					<description>ADC or Filter Output Channel 1</description>
					<addressOffset>0x54</addressOffset>
					<size>32</size>
					<resetValue>#00000000000000000000000000000000</resetValue>
					<resetMask>#11111111111111111111110000000000</resetMask>
					<fields>
						<field>
							<name>OUT_CH1</name>
							<description>ADC or filter output value channel 1</description>
							<lsb>0</lsb>
							<msb>9</msb>
							<access>read-only</access>
						</field>
					</fields>
				</register>
