cmsis-svd/cmsis-svd/data/Infineon/TLE9879-2.svd
				<register>
					<name>MMODE0_5</name>
					<description>Overvoltage Measurement Mode of Ch 0-5</description>
					<addressOffset>0xB0</addressOffset>
					<size>32</size>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>Ch5</name>
							<description>Measurement mode ch 5</description>
							<lsb>10</lsb>
							<msb>11</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>MMODE0</name>
									<description>upper and lower voltage/limit measurement</description>
									<value>0b00</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>MMODEUV</name>
									<description>undervoltage/-limit measurement</description>
									<value>0b01</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>MMODEOV</name>
									<description>overvoltage/-limit measurement</description>
									<value>0b10</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>Ch4</name>
							<description>Measurement mode ch 4</description>
							<lsb>8</lsb>
							<msb>9</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>MMODE0</name>
									<description>upper and lower voltage/limit measurement</description>
									<value>0b00</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>MMODEUV</name>
									<description>undervoltage/-limit measurement</description>
									<value>0b01</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>MMODEOV</name>
									<description>overvoltage/-limit measurement</description>
									<value>0b10</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>Ch3</name>
							<description>Measurement mode ch 3</description>
							<lsb>6</lsb>
							<msb>7</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>MMODE0</name>
									<description>upper and lower voltage/limit measurement</description>
									<value>0b00</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>MMODEUV</name>
									<description>undervoltage/-limit measurement</description>
									<value>0b01</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>MMODEOV</name>
									<description>overvoltage/-limit measurement</description>
									<value>0b10</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>Ch2</name>
							<description>Measurement mode ch 2</description>
							<lsb>4</lsb>
							<msb>5</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>MMODE0</name>
									<description>upper and lower voltage/limit measurement</description>
									<value>0b00</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>MMODEUV</name>
									<description>undervoltage/-limit measurement</description>
									<value>0b01</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>MMODEOV</name>
									<description>overvoltage/-limit measurement</description>
									<value>0b10</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>Ch1</name>
							<description>Measurement mode ch 1</description>
							<lsb>2</lsb>
							<msb>3</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>MMODE0</name>
									<description>upper and lower voltage/limit measurement</description>
									<value>0b00</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>MMODEUV</name>
									<description>undervoltage/-limit measurement</description>
									<value>0b01</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>MMODEOV</name>
									<description>overvoltage/-limit measurement</description>
									<value>0b10</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>Ch0</name>
							<description>Measurement mode ch 0</description>
							<lsb>0</lsb>
							<msb>1</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>MMODE0</name>
									<description>upper and lower voltage/limit measurement</description>
									<value>0b00</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>MMODEUV</name>
									<description>undervoltage/-limit measurement</description>
									<value>0b01</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>MMODEOV</name>
									<description>overvoltage/-limit measurement</description>
									<value>0b10</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>SQ1_4</name>
					<description>Measurement Channel Enable Bits for Cycle 1-4</description>
					<addressOffset>0x20</addressOffset>
					<size>32</size>
					<resetValue>0x29362837</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>SQ4</name>
							<description>Sequence 4 channel enable</description>
							<lsb>24</lsb>
							<msb>29</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>SQ3</name>
							<description>Sequence 3 channel enable</description>
							<lsb>16</lsb>
							<msb>21</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>SQ2</name>
							<description>Sequence 2 channel enable</description>
							<lsb>8</lsb>
							<msb>13</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>SQ1</name>
							<description>Sequence 1 channel enable</description>
							<lsb>0</lsb>
							<msb>5</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>SQ1_8_int</name>
					<description>Measurement Channel Enable Bits for Cycle 1 - 8</description>
					<addressOffset>0x2C</addressOffset>
					<size>32</size>
					<resetValue>0x7B7B7B1B</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>SQ8_int</name>
							<description>Sequence 8 channel enable</description>
							<lsb>28</lsb>
							<msb>31</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>SQ7_int</name>
							<description>Sequence 7 channel enable</description>
							<lsb>24</lsb>
							<msb>27</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>SQ6_int</name>
							<description>Sequence 6 channel enable</description>
							<lsb>20</lsb>
							<msb>23</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>SQ5_int</name>
							<description>Sequence 5 channel enable</description>
							<lsb>16</lsb>
							<msb>19</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>SQ4_int</name>
							<description>Sequence 4 channel enable</description>
							<lsb>12</lsb>
							<msb>15</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>SQ3_int</name>
							<description>Sequence 3 channel enable</description>
							<lsb>8</lsb>
							<msb>11</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>SQ2_int</name>
							<description>Sequence 2 channel enable</description>
							<lsb>4</lsb>
							<msb>7</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>SQ1_int</name>
							<description>Sequence 1 channel enable</description>
							<lsb>0</lsb>
							<msb>3</msb>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>SQ5_8</name>
					<description>Measurement Channel Enable Bits for Cycle 5 - 8</description>
					<addressOffset>0x24</addressOffset>
					<size>32</size>
					<resetValue>0x28372836</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>SQ8</name>
							<description>Sequence 8 channel enable</description>
							<lsb>24</lsb>
							<msb>29</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>SQ7</name>
							<description>Sequence 7 channel enable</description>
							<lsb>16</lsb>
							<msb>21</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>SQ6</name>
							<description>Sequence 6 channel enable</description>
							<lsb>8</lsb>
							<msb>13</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>SQ5</name>
							<description>Sequence 5 channel enable</description>
							<lsb>0</lsb>
							<msb>5</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>SQ9_10</name>
					<description>Measurement Channel Enable Bits for Cycle 9 - 10</description>
					<addressOffset>0x28</addressOffset>
					<size>32</size>
					<resetValue>0x00002936</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>SQ10</name>
							<description>Sequence 10 channel enable</description>
							<lsb>8</lsb>
							<msb>13</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>SQ9</name>
							<description>Sequence 9 channel enable</description>
							<lsb>0</lsb>
							<msb>5</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>SQ9_10_int</name>
					<description>Measurement Channel Enable Bits for Cycle 9 and 10</description>
					<addressOffset>0x30</addressOffset>
					<size>32</size>
					<resetValue>0x0000007B</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>SQ10_int</name>
							<description>Sequence 10 channel enable</description>
							<lsb>4</lsb>
							<msb>7</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>SQ9_int</name>
							<description>Sequence 9 channel enable</description>
							<lsb>0</lsb>
							<msb>3</msb>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>SQ_FB</name>
					<description>Sequencer Feedback Register</description>
					<addressOffset>0x04</addressOffset>
					<size>32</size>
					<resetValue>#00000000000000000000000000000000</resetValue>
					<resetMask>#11111111111000001000000011110000</resetMask>
					<fields>
						<field>
							<name>CHx</name>
							<description>Current ADC2 Channel</description>
							<lsb>16</lsb>
							<msb>20</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>CH0</name>
									<description>Channel 0 enable</description>
									<value>0b00000</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CH1</name>
									<description>Channel 1 enable</description>
									<value>0b00001</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CH2</name>
									<description>Channel 2 enable</description>
									<value>0b00010</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CH3</name>
									<description>Channel 3 enable</description>
									<value>0b00011</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CH4</name>
									<description>Channel 4 enable</description>
									<value>0b00100</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CH5</name>
									<description>Channel 5 enable</description>
									<value>0b00101</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CH6</name>
									<description>Channel 6 enable</description>
									<value>0b00110</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CH7</name>
									<description>Channel 7 enable</description>
									<value>0b11101</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CH8</name>
									<description>Channel 8 enable</description>
									<value>0b11110</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CH9</name>
									<description>Channel 9 enable</description>
									<value>0b11111</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>SQx</name>
							<description>Current Active Sequencer</description>
							<lsb>11</lsb>
							<msb>14</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>SQ0</name>
									<description>Sequence 0 enable</description>
									<value>0b0000</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>SQ1</name>
									<description>Sequence 1 enable</description>
									<value>0b0001</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>SQ2</name>
									<description>Sequence 2 enable</description>
									<value>0b0010</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>SQ3</name>
									<description>Sequence 3 enable</description>
									<value>0b0011</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>SQ4</name>
									<description>Sequence 4 enable</description>
									<value>0b0100</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>SQ5</name>
									<description>Sequence 5 enable</description>
									<value>0b0101</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>SQ6</name>
									<description>Sequence 6 enable</description>
									<value>0b0110</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>SQ7</name>
									<description>Sequence 7 enable</description>
									<value>0b0111</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>SQ8</name>
									<description>Sequence 8 enable</description>
									<value>0b1000</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>SQ9</name>
									<description>Sequence 9 enable</description>
									<value>0b1001</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>ESM_ACTIVE</name>
							<description>ADC2 ESM active</description>
							<lsb>10</lsb>
							<msb>10</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>not_active</name>
									<description>ESM not active</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>active</name>
									<description>ESM active</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>EIM_ACTIVE</name>
							<description>ADC2 EIM active</description>
							<lsb>9</lsb>
							<msb>9</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>not_active</name>
									<description>EIM not active</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>active</name>
									<description>EIM active</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>SQ_STOP</name>
							<description>ADC2 Sequencer Stop Signal for DPP</description>
							<lsb>8</lsb>
							<msb>8</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>DPP_Running</name>
									<description>Postprocessing Sequencer in running mode</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>DPP_Stopped</name>
									<description>Postprocessing Sequencer stopped / Software Mode entered</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>SQ_FB</name>
							<description>Current Sequence that caused software mode</description>
							<lsb>0</lsb>
							<msb>3</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>SQ1</name>
									<description>Sequence 1</description>
									<value>0b0000</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>SQ2</name>
									<description>Sequence 2</description>
									<value>0b0001</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>SQ3</name>
									<description>Sequence 3</description>
									<value>0b0010</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>SQ4</name>
									<description>Sequence 4</description>
									<value>0b0011</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>SQ5</name>
									<description>Sequence 5</description>
									<value>0b0100</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>SQ6</name>
									<description>Sequence 6</description>
									<value>0b0101</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>SQ7</name>
									<description>Sequence 7</description>
									<value>0b0110</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>SQ8</name>
									<description>Sequence 8</description>
									<value>0b0111</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>SQ9</name>
									<description>Sequence 9</description>
									<value>0b1000</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>SQ10</name>
									<description>Sequence 10</description>
									<value>0b1001</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ESM</name>
									<description>Exceptional Sequencer Mode</description>
									<value>0b1010</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CH_MASK</name>
									<description>Channel Mask = 0</description>
									<value>0b1011</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>SUSPEND</name>
									<description>Debug Suspend Mode</description>
									<value>0b1100</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>TH0_3_LOWER</name>
					<description>Lower Comparator Trigger Level Channel 0 -3</description>
					<addressOffset>0x80</addressOffset>
					<size>32</size>
					<resetValue>0x3C2C3A42</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>CH3</name>
							<description>Channel 3 lower trigger level</description>
							<lsb>24</lsb>
							<msb>31</msb>
						</field>
						<field>
							<name>CH2</name>
							<description>Channel 2 lower trigger level</description>
							<lsb>16</lsb>
							<msb>23</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>CH1</name>
							<description>Channel 1 lower trigger level</description>
							<lsb>8</lsb>
							<msb>15</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>CH0</name>
							<description>Channel 0 lower trigger level</description>
							<lsb>0</lsb>
							<msb>7</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>TH0_3_UPPER</name>
					<description>Upper Comparator Trigger Level Channel 0-3</description>
					<addressOffset>0x8C</addressOffset>
					<size>32</size>
					<resetValue>0xA8ABDAE2</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>CH3</name>
							<description>Channel 3 upper trigger level</description>
							<lsb>24</lsb>
							<msb>31</msb>
							<access>read-write</access>
							<!--<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>min. threshold value = 0</description>
									<value>0x00</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>max. threshold value = 255</description>
									<value>0xFF</value>
								</enumeratedValue>
							</enumeratedValues>-->
						</field>
						<field>
							<name>CH2</name>
							<description>Channel 2 upper trigger level</description>
							<lsb>16</lsb>
							<msb>23</msb>
							<access>read-write</access>
							<!--<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>min. threshold value = 0</description>
									<value>0x00</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>max. threshold value = 255</description>
									<value>0xFF</value>
								</enumeratedValue>
							</enumeratedValues>-->
						</field>
						<field>
							<name>CH1</name>
							<description>Channel 1 upper trigger level</description>
							<lsb>8</lsb>
							<msb>15</msb>
							<access>read-write</access>
							<!--<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>min. threshold value = 0</description>
									<value>0x00</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>max. threshold value = 255</description>
									<value>0xFF</value>
								</enumeratedValue>
							</enumeratedValues>-->
						</field>
						<field>
							<name>CH0</name>
							<description>Channel 0 upper trigger level</description>
							<lsb>0</lsb>
							<msb>7</msb>
							<access>read-write</access>
							<!--<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>min. threshold value = 0</description>
									<value>0x00</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>max. threshold value = 255</description>
									<value>0xFF</value>
								</enumeratedValue>
							</enumeratedValues>-->
						</field>
					</fields>
				</register>
