cmsis-svd/cmsis-svd/data/Infineon/TLE9879-2.svd
				<register>
					<name>TH4_5_LOWER</name>
					<description>Lower Comparator Trigger Level Channel 4 and 5</description>
					<addressOffset>0x84</addressOffset>
					<size>32</size>
					<resetValue>0x00009A2C</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>CH5</name>
							<description>Channel 5 lower trigger level</description>
							<lsb>8</lsb>
							<msb>15</msb>
							<access>read-write</access>
							<!--<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>Min. threshold value</description>
									<value>0x00</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>Max. threshold value</description>
									<value>0xFF</value>
								</enumeratedValue>
							</enumeratedValues>-->
						</field>
						<field>
							<name>CH4</name>
							<description>Channel 4 lower trigger level</description>
							<lsb>0</lsb>
							<msb>7</msb>
							<access>read-write</access>
							<!--<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>Min. threshold value</description>
									<value>0x00</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>Max. threshold value</description>
									<value>0xFF</value>
								</enumeratedValue>
							</enumeratedValues>-->
						</field>
					</fields>
				</register>
				<register>
					<name>TH4_5_UPPER</name>
					<description>Upper Comparator Trigger Level Channel 4 -5</description>
					<addressOffset>0x90</addressOffset>
					<size>32</size>
					<resetValue>0x0000BC42</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>CH5</name>
							<description>Channel 5 upper trigger level</description>
							<lsb>8</lsb>
							<msb>15</msb>
							<access>read-write</access>
							<!--<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>min. threshold value = 0</description>
									<value>0x00</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>max. threshold value = 255</description>
									<value>0xFF</value>
								</enumeratedValue>
							</enumeratedValues>-->
						</field>
						<field>
							<name>CH4</name>
							<description>Channel 4 upper trigger level</description>
							<lsb>0</lsb>
							<msb>7</msb>
							<access>read-write</access>
							<!--<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>min. threshold value = 0</description>
									<value>0x00</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>max. threshold value = 255</description>
									<value>0xFF</value>
								</enumeratedValue>
							</enumeratedValues>-->
						</field>
					</fields>
				</register>
				<register>
					<name>TH6_9_LOWER</name>
					<description>Lower Comparator Trigger Level Channel 6 -9</description>
					<addressOffset>0x88</addressOffset>
					<size>32</size>
					<resetValue>0xC7D3BBDB</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>CH9</name>
							<description>Channel 9 lower trigger level</description>
							<lsb>24</lsb>
							<msb>31</msb>
							<access>read-write</access>
							<!--<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>Min. threshold value</description>
									<value>0x00</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>Max. threshold value</description>
									<value>0xFF</value>
								</enumeratedValue>
							</enumeratedValues>-->
						</field>
						<field>
							<name>CH8</name>
							<description>Channel 8 lower trigger level</description>
							<lsb>16</lsb>
							<msb>23</msb>
							<access>read-write</access>
							<!--<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>Min. threshold value</description>
									<value>0x00</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>Max. threshold value</description>
									<value>0xFF</value>
								</enumeratedValue>
							</enumeratedValues>-->
						</field>
						<field>
							<name>CH7</name>
							<description>Channel 7 lower trigger level</description>
							<lsb>8</lsb>
							<msb>15</msb>
							<access>read-only</access>
							<!--<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>Min. threshold value</description>
									<value>0x00</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>Max. threshold value</description>
									<value>0xFF</value>
								</enumeratedValue>
							</enumeratedValues>-->
						</field>
						<field>
							<name>CH6</name>
							<description>Channel 6 lower trigger level</description>
							<lsb>0</lsb>
							<msb>7</msb>
							<access>read-write</access>
							<!--<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>Min. threshold value</description>
									<value>0x00</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>Max. threshold value</description>
									<value>0xFF</value>
								</enumeratedValue>
							</enumeratedValues>-->
						</field>
					</fields>
				</register>
				<register>
					<name>TH6_9_UPPER</name>
					<description>Upper Comparator Trigger Level Channel 6 -9</description>
					<addressOffset>0x94</addressOffset>
					<size>32</size>
					<resetValue>0xE2FAC6EE</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>CH9</name>
							<description>Channel 9 upper trigger level</description>
							<lsb>24</lsb>
							<msb>31</msb>
							<access>read-only</access>
							<!--<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>min. threshold value = 0</description>
									<value>0x00</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>max. threshold value = 255</description>
									<value>0xFF</value>
								</enumeratedValue>
							</enumeratedValues>-->
						</field>
						<field>
							<name>CH8</name>
							<description>Channel 8 upper trigger level</description>
							<lsb>16</lsb>
							<msb>23</msb>
							<access>read-only</access>
							<!--<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>min. threshold value = 0</description>
									<value>0x00</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>max. threshold value = 255</description>
									<value>0xFF</value>
								</enumeratedValue>
							</enumeratedValues>-->
						</field>
						<field>
							<name>CH7</name>
							<description>Channel 7 upper trigger level</description>
							<lsb>8</lsb>
							<msb>15</msb>
							<access>read-only</access>
							<!--<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>min. threshold value = 0</description>
									<value>0x00</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>max. threshold value = 255</description>
									<value>0xFF</value>
								</enumeratedValue>
							</enumeratedValues>-->
						</field>
						<field>
							<name>CH6</name>
							<description>Channel 6 upper trigger level</description>
							<lsb>0</lsb>
							<msb>7</msb>
							<access>read-only</access>
							<!--<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>min. threshold value = 0</description>
									<value>0x00</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>max. threshold value = 255</description>
									<value>0xFF</value>
								</enumeratedValue>
							</enumeratedValues>-->
						</field>
					</fields>
				</register>
