cmsis-svd/cmsis-svd/data/Infineon/TLE9879-2.svd
				<register>
					<name>OFF_SEQ_CTRL</name>
					<description>Turn on Slewrate Sequencer Control</description>
					<addressOffset>0x10</addressOffset>
					<size>32</size>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>DRV_OFF_I_1</name>
							<description>Slew rate sequencer off phase 1 current</description>
							<lsb>27</lsb>
							<msb>31</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>Disabled</name>
									<description>Slew Rate Control is disabled</description>
									<value>0x0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Maximum</name>
									<description>maximum output discharge current</description>
									<value>0x1f</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>DRV_OFF_t_1</name>
							<description>Slew rate sequencer off phase 1 time</description>
							<lsb>24</lsb>
							<msb>26</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>50ns</name>
									<description>50ns phase duration</description>
									<value>0x0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>400ns</name>
									<description>400ns phase duration</description>
									<value>0x7</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>DRV_OFF_I_2</name>
							<description>Slew rate sequencer off phase 2 current</description>
							<lsb>19</lsb>
							<msb>23</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>Disabled</name>
									<description>Slew Rate Control is disabled</description>
									<value>0x0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Maximum</name>
									<description>maximum output discharge current</description>
									<value>0x1f</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>DRV_OFF_t_2</name>
							<description>Slew rate sequencer off phase 2 time</description>
							<lsb>16</lsb>
							<msb>18</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>50ns</name>
									<description>50ns phase duration</description>
									<value>0x0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>400ns</name>
									<description>400ns phase duration</description>
									<value>0x7</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>DRV_OFF_I_3</name>
							<description>Slew rate sequencer off phase 3 current</description>
							<lsb>11</lsb>
							<msb>15</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>Disabled</name>
									<description>Slew Rate Control is disabled</description>
									<value>0x0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Maximum</name>
									<description>maximum output discharge current</description>
									<value>0x1f</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>DRV_OFF_t_3</name>
							<description>Slew rate sequencer off phase 3 time</description>
							<lsb>8</lsb>
							<msb>10</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>50ns</name>
									<description>50ns phase duration</description>
									<value>0x0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>400ns</name>
									<description>400ns phase duration</description>
									<value>0x7</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>DRV_OFF_I_4</name>
							<description>Slew rate sequencer off phase 4 current</description>
							<lsb>3</lsb>
							<msb>7</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>Disabled</name>
									<description>Slew Rate Control is disabled</description>
									<value>0x0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Maximum</name>
									<description>maximum output discharge current</description>
									<value>0x1f</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>DRV_OFF_t_4</name>
							<description>Slew rate sequencer off phase 4 time</description>
							<lsb>0</lsb>
							<msb>2</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>50ns</name>
									<description>50ns phase duration</description>
									<value>0x0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>400ns</name>
									<description>400ns phase duration</description>
									<value>0x7</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>ON_SEQ_CTRL</name>
					<description>Turn off Slewrate Sequencer Control</description>
					<addressOffset>0x14</addressOffset>
					<size>32</size>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>DRV_ON_I_1</name>
							<description>Slew rate sequencer on phase 1 current</description>
							<lsb>27</lsb>
							<msb>31</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>Disabled</name>
									<description>Slew Rate Control is disabled</description>
									<value>0x0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Maximum</name>
									<description>maximum output discharge current</description>
									<value>0x1f</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>DRV_ON_t_1</name>
							<description>Slew rate sequencer on phase 1 time</description>
							<lsb>24</lsb>
							<msb>26</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>50ns</name>
									<description>50ns phase duration</description>
									<value>0x0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>400ns</name>
									<description>400ns phase duration</description>
									<value>0x7</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>DRV_ON_I_2</name>
							<description>Slew rate sequencer on phase 2 current</description>
							<lsb>19</lsb>
							<msb>23</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>Disabled</name>
									<description>Slew Rate Control is disabled</description>
									<value>0x0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Maximum</name>
									<description>maximum output discharge current</description>
									<value>0x1f</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>DRV_ON_t_2</name>
							<description>Slew rate sequencer on phase 2 time</description>
							<lsb>16</lsb>
							<msb>18</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>50ns</name>
									<description>50ns phase duration</description>
									<value>0x0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>400ns</name>
									<description>400ns phase duration</description>
									<value>0x7</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>DRV_ON_I_3</name>
							<description>Slew rate sequencer on phase 3 current</description>
							<lsb>11</lsb>
							<msb>15</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>Disabled</name>
									<description>Slew Rate Control is disabled</description>
									<value>0x0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Maximum</name>
									<description>maximum output discharge current</description>
									<value>0x1f</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>DRV_ON_t_3</name>
							<description>Slew rate sequencer on phase 3 time</description>
							<lsb>8</lsb>
							<msb>10</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>50ns</name>
									<description>50ns phase duration</description>
									<value>0x0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>400ns</name>
									<description>400ns phase duration</description>
									<value>0x7</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>DRV_ON_I_4</name>
							<description>Slew rate sequencer on phase 4 current</description>
							<lsb>3</lsb>
							<msb>7</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>Disabled</name>
									<description>Slew Rate Control is disabled</description>
									<value>0x0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Maximum</name>
									<description>maximum output discharge current</description>
									<value>0x1f</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>DRV_ON_t_4</name>
							<description>Slew rate sequencer on phase 4 time</description>
							<lsb>0</lsb>
							<msb>2</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>50ns</name>
									<description>50ns phase duration</description>
									<value>0x0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>400ns</name>
									<description>400ns phase duration</description>
									<value>0x7</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
