cmsis-svd/cmsis-svd/data/Infineon/TLE9879-2.svd
			</registers>
		</peripheral>
		<peripheral>
			<name>CPU</name>
			<description>CPU Core</description>
			<baseAddress>0xE000E000</baseAddress>
			<addressBlock>
				<offset>0x0</offset>
				<size>0x1000</size>
				<usage>registers</usage>
			</addressBlock>
			<registers>
				<register>
					<name>AFSR</name>
					<description>Auxiliary Fault Status Register</description>
					<addressOffset>0xD3C</addressOffset>
					<size>32</size>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>CP0</name>
							<description>Access Privileges for Coprocessor 0 (n= 0-7, 10, 11)</description>
							<lsb>0</lsb>
							<msb>1</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>Access denied. Any attempted access generates a NOCP UsageFault</description>
									<value>0b00</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>Privileged access only. An unprivileged access generates a NOCP UsageFault</description>
									<value>0b01</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value4</name>
									<description>Full access</description>
									<value>0b11</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>CP1</name>
							<description>Access Privileges for Coprocessor 1 (n= 0-7, 10, 11)</description>
							<lsb>2</lsb>
							<msb>3</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>Access denied. Any attempted access generates a NOCP UsageFault</description>
									<value>0b00</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>Privileged access only. An unprivileged access generates a NOCP UsageFault</description>
									<value>0b01</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value4</name>
									<description>Full access</description>
									<value>0b11</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>CP2</name>
							<description>Access Privileges for Coprocessor 2 (n= 0-7, 10, 11)</description>
							<lsb>4</lsb>
							<msb>5</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>Access denied. Any attempted access generates a NOCP UsageFault</description>
									<value>0b00</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>Privileged access only. An unprivileged access generates a NOCP UsageFault</description>
									<value>0b01</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value4</name>
									<description>Full access</description>
									<value>0b11</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>CP3</name>
							<description>Access Privileges for Coprocessor 3 (n= 0-7, 10, 11)</description>
							<lsb>6</lsb>
							<msb>7</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>Access denied. Any attempted access generates a NOCP UsageFault</description>
									<value>0b00</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>Privileged access only. An unprivileged access generates a NOCP UsageFault</description>
									<value>0b01</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value4</name>
									<description>Full access</description>
									<value>0b11</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>CP4</name>
							<description>Access Privileges for Coprocessor 4 (n= 0-7, 10, 11)</description>
							<lsb>8</lsb>
							<msb>9</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>Access denied. Any attempted access generates a NOCP UsageFault</description>
									<value>0b00</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>Privileged access only. An unprivileged access generates a NOCP UsageFault</description>
									<value>0b01</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value4</name>
									<description>Full access</description>
									<value>0b11</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>CP5</name>
							<description>Access Privileges for Coprocessor 5 (n= 0-7, 10, 11)</description>
							<lsb>10</lsb>
							<msb>11</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>Access denied. Any attempted access generates a NOCP UsageFault</description>
									<value>0b00</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>Privileged access only. An unprivileged access generates a NOCP UsageFault</description>
									<value>0b01</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value4</name>
									<description>Full access</description>
									<value>0b11</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>CP6</name>
							<description>Access Privileges for Coprocessor 6 (n= 0-7, 10, 11)</description>
							<lsb>12</lsb>
							<msb>13</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>Access denied. Any attempted access generates a NOCP UsageFault</description>
									<value>0b00</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>Privileged access only. An unprivileged access generates a NOCP UsageFault</description>
									<value>0b01</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value4</name>
									<description>Full access</description>
									<value>0b11</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>CP7</name>
							<description>Access Privileges for Coprocessor 7 (n= 0-7, 10, 11)</description>
							<lsb>14</lsb>
							<msb>15</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>Access denied. Any attempted access generates a NOCP UsageFault</description>
									<value>0b00</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>Privileged access only. An unprivileged access generates a NOCP UsageFault</description>
									<value>0b01</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value4</name>
									<description>Full access</description>
									<value>0b11</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>CP10</name>
							<description>Access Privileges for Coprocessor 10 (n= 0-7, 10, 11)</description>
							<lsb>20</lsb>
							<msb>21</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>Access denied. Any attempted access generates a NOCP UsageFault</description>
									<value>0b00</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>Privileged access only. An unprivileged access generates a NOCP UsageFault</description>
									<value>0b01</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value4</name>
									<description>Full access</description>
									<value>0b11</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>CP11</name>
							<description>Access Privileges for Coprocessor 11 (n= 0-7, 10, 11)</description>
							<lsb>22</lsb>
							<msb>23</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>Access denied. Any attempted access generates a NOCP UsageFault</description>
									<value>0b00</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>Privileged access only. An unprivileged access generates a NOCP UsageFault</description>
									<value>0b01</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value4</name>
									<description>Full access</description>
									<value>0b11</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>AIRCR</name>
					<description>Application Interrupt/Reset Control Register</description>
					<addressOffset>0xD0C</addressOffset>
					<size>32</size>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>VECTKEY</name>
							<description>Vector Key</description>
							<lsb>16</lsb>
							<msb>31</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>ENDIANNESS</name>
							<description>Memory System Endianness</description>
							<lsb>15</lsb>
							<msb>15</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>little endian</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>big endian</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>PRIGROUP</name>
							<description>Priority Grouping</description>
							<lsb>8</lsb>
							<msb>10</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>SYSRESETREQ</name>
							<description>System Reset Request</description>
							<lsb>2</lsb>
							<msb>2</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>do not request a reset</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>request a reset</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>VECTCLRACTIVE</name>
							<description>VECTCLRACTIVE for debug only</description>
							<lsb>1</lsb>
							<msb>1</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>VECTRESET</name>
							<description>VECTRESET for debug only</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>BFAR</name>
					<description>Bus Fault Status Register</description>
					<addressOffset>0xD38</addressOffset>
					<size>32</size>
					<resetValue>0x00000000</resetValue>
					<resetMask>0x00000000</resetMask>
					<fields>
						<field>
							<name>ADDRESS</name>
							<description>Data Address for a precise BusFault</description>
							<lsb>0</lsb>
							<msb>31</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>CCR</name>
					<description>Configuration Control Register</description>
					<addressOffset>0xD14</addressOffset>
					<size>32</size>
					<resetValue>0x00000200</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>STKALIGN</name>
							<description>stack alignment</description>
							<lsb>9</lsb>
							<msb>9</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>guaranteed SP alignment is 4-byte, no SP adjustment is performed.</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>8-byte alignment guaranteed, SP adjusted if necessary.</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>BFHFMIGN</name>
							<description>Enables handlers with priority -1 or -2 to ignore data BusFaults caused by load and store instructions</description>
							<lsb>8</lsb>
							<msb>8</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>precise data access fault causes a lockup</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>handler ignores the fault</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>DIV_0_TRP</name>
							<description>Enables faulting or halting when the processor executes an SDIV or UDIV instruction with a divisor of 0</description>
							<lsb>4</lsb>
							<msb>4</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>trapping disabled</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>trapping enabled</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>UNALIGN_TRP</name>
							<description>Enables unaligned access traps</description>
							<lsb>3</lsb>
							<msb>3</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>trapping disabled</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>trapping enabled</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>USERSETMPEND</name>
							<description>Enables unprivileged software access to the STIR</description>
							<lsb>1</lsb>
							<msb>1</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>unprivileged software cannot access the STIR.</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>unprivileged software can access the STIR.</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>NONBASETHRDENA</name>
							<description>Indicates how the processor enters Thread mode</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>any attempt to enter Thread mode at an execution priority level of other than base level faults.</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>the processor can enter Thread mode at any execution priority level because of a controlled return value.</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
