cmsis-svd/cmsis-svd/data/Infineon/TLE9879-2.svd
				<register>
					<name>SHPR2</name>
					<description>System Handler Priority Register 2</description>
					<addressOffset>0x21C</addressOffset>
					<size>32</size>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>PRI_11</name>
							<description>Priority of System Handler 11, SVCall</description>
							<lsb>24</lsb>
							<msb>31</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>PRI_10</name>
							<description>Reserved for Priority of System Handler 10</description>
							<lsb>16</lsb>
							<msb>23</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>PRI_9</name>
							<description>Reserved for Priority of System Handler 9</description>
							<lsb>8</lsb>
							<msb>15</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>PRI_8</name>
							<description>Reserved for Priority of System Handler 8</description>
							<lsb>0</lsb>
							<msb>7</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>SHPR3</name>
					<description>System Handler Priority Register 3</description>
					<addressOffset>0xD20</addressOffset>
					<size>32</size>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>PRI_15</name>
							<description>Priority of System Handler 15, SysTick</description>
							<lsb>24</lsb>
							<msb>31</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>PRI_14</name>
							<description>Priority of System Handler 14, PendSV</description>
							<lsb>16</lsb>
							<msb>23</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>PRI_13</name>
							<description>Reserved for Priority of System Handler 13</description>
							<lsb>8</lsb>
							<msb>15</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>PRI_12</name>
							<description>Priority of System Handler 12, DebugMonitor</description>
							<lsb>0</lsb>
							<msb>7</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>SYSTICK_CAL</name>
					<description>SysTick Calibration Value</description>
					<addressOffset>0x01C</addressOffset>
					<size>32</size>
					<resetValue>#00000000000000000000000000000000</resetValue>
					<resetMask>#00111111000000000000000000000000</resetMask>
					<fields>
						<field>
							<name>NOREF</name>
							<description>No Reference Clock</description>
							<lsb>31</lsb>
							<msb>31</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>n.u.</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>the reference clock is not provided</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>SKEW</name>
							<description>Skew</description>
							<lsb>30</lsb>
							<msb>30</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>n.u.</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>the calibration value is not exactly 10 ms because of clock frequency. This could affect its suitability as a software real time clock.</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>TENMS</name>
							<description>Tenms</description>
							<lsb>0</lsb>
							<msb>23</msb>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>SYSTICK_CS</name>
					<description>SysTick Control and Status</description>
					<addressOffset>0x010</addressOffset>
					<size>32</size>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>COUNTFLAG</name>
							<description>Count Flag</description>
							<lsb>16</lsb>
							<msb>16</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>CLKSOURCE</name>
							<description>CLK Source</description>
							<lsb>2</lsb>
							<msb>2</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>external reference clock (STCLK : 4:1 from hclk)</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>core clock (HCLK)</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>TICKINT</name>
							<description>Enables SysTick exception request</description>
							<lsb>1</lsb>
							<msb>1</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>DISABLED</name>
									<description>counting down to zero does not assert the SysTick exception request</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENABLED</name>
									<description>counting down to zero asserts the SysTick exception request</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>ENABLE</name>
							<description>Enable</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>counter disabled.</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>counter operates in a multi-shot way. That is, counter loads with the Reload value and then begins counting down. On reaching 0, it sets the COUNTFLAG to 1 and optionally pends the SysTick handler, based on TICKINT. It then loads the Reload value again, and begins counting.</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>SYSTICK_CUR</name>
					<description>SysTick Current Value</description>
					<addressOffset>0x018</addressOffset>
					<size>32</size>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFF000000</resetMask>
					<fields>
						<field>
							<name>CURRENT</name>
							<description>Current</description>
							<lsb>0</lsb>
							<msb>23</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>SYSTICK_RL</name>
					<description>SysTick Reload Value</description>
					<addressOffset>0x014</addressOffset>
					<size>32</size>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFF000000</resetMask>
					<fields>
						<field>
							<name>RELOAD</name>
							<description>Reload</description>
							<lsb>0</lsb>
							<msb>23</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>VTOR</name>
					<description>Vector Table Offset Register</description>
					<addressOffset>0xD08</addressOffset>
					<size>32</size>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>TBLOFF</name>
							<description>Vector Table Offset</description>
							<lsb>7</lsb>
							<msb>31</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
