cmsis-svd/cmsis-svd/data/Infineon/TLE9879-2.svd
			</registers>
		</peripheral>
		<peripheral>
			<name>MF</name>
			<description>Measurement Function</description>
			<baseAddress>0x48018000</baseAddress>
			<addressBlock>
				<offset>0x0</offset>
				<size>0x4000</size>
				<usage>registers</usage>
			</addressBlock>
			<registers>
				<register>
					<name>BEMFC_CTRL_STS</name>
					<description>BEMF Comparator Control Status Register</description>
					<addressOffset>0x08</addressOffset>
					<size>32</size>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>PHW_ZC_STS</name>
							<description>Phase W Comparator zero crossing status</description>
							<lsb>18</lsb>
							<msb>18</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>Below_Threshold</name>
									<description>zero crossing comparator input is below threshold</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Above_Threshold</name>
									<description>zero crossing comparator input is above threshold</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>PHV_ZC_STS</name>
							<description>Phase V Comparator zero crossing status</description>
							<lsb>17</lsb>
							<msb>17</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>Below_Threshold</name>
									<description>zero crossing comparator input is below threshold</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Above_Threshold</name>
									<description>zero crossing comparator input is above threshold</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>PHU_ZC_STS</name>
							<description>Phase U Comparator zero crossing status</description>
							<lsb>16</lsb>
							<msb>16</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>Below_Threshold</name>
									<description>zero crossing comparator input is below threshold</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Above_Threshold</name>
									<description>zero crossing comparator input is above threshold</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>CCPOS_INSEL</name>
							<description>CCPOSx_3 INSEL select, x = 0,1,2</description>
							<lsb>12</lsb>
							<msb>12</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>GPIO</name>
									<description>GPIO selected</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>BEMF</name>
									<description>BEMF selected</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>PHWCOMP_ON</name>
							<description>Phase W Comparator on</description>
							<lsb>10</lsb>
							<msb>10</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>DISABLE</name>
									<description>Comparator is switched off</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENABLE</name>
									<description>Comparator is switched on</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>PHVCOMP_ON</name>
							<description>Phase V Comparator on</description>
							<lsb>9</lsb>
							<msb>9</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>DISABLE</name>
									<description>Comparator is switched off</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENABLE</name>
									<description>Comparator is switched on</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>PHUCOMP_ON</name>
							<description>Phase U Comparator on</description>
							<lsb>8</lsb>
							<msb>8</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>DISABLE</name>
									<description>Comparator is switched off</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENABLE</name>
									<description>Comparator is switched on</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>GPT12CAPINB</name>
							<description>GPT12 CAPINB Value</description>
							<lsb>5</lsb>
							<msb>5</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>GPIO</name>
									<description>CAPINB Input of GPT12 is connected to P0.3</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>BEMF</name>
									<description>CAPINB Input of GPT12 is connected to internal BEMF Comparator Output</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>FILTBYPS</name>
							<description>BEMF Comparator Output Filter Bypass</description>
							<lsb>4</lsb>
							<msb>4</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>ENABLED</name>
									<description>BEMF Comparator Output Filter enabled</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>DISABLED</name>
									<description>BEMF Comparator Output Filter disabled</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>DEMGFILTDIS</name>
							<description>BEMF Comparator Demagnetisation (Demag) Filter Disable</description>
							<lsb>3</lsb>
							<msb>3</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>ENABLED</name>
									<description>BEMF Comparator Demag Filter enabled</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>DISABLED</name>
									<description>BEMF Comparator Demag Filter disabled</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>PHWCOMP_EN</name>
							<description>Phase W Comparator enable</description>
							<lsb>2</lsb>
							<msb>2</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>DISABLE</name>
									<description>Comparator is disabled</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENABLE</name>
									<description>Comparator is enabled</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>PHVCOMP_EN</name>
							<description>Phase V Comparator enable</description>
							<lsb>1</lsb>
							<msb>1</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>DISABLE</name>
									<description>Comparator is disabled</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENABLE</name>
									<description>Comparator is enabled</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>PHUCOMP_EN</name>
							<description>Phase U Comparator enable</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>DISABLE</name>
									<description>Comparator is disabled</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENABLE</name>
									<description>Comparator is enabled</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>CSA_CTRL</name>
					<description>Current Sense Amplifier Control Register</description>
					<addressOffset>0x0C</addressOffset>
					<size>32</size>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>VZERO</name>
							<description>Current Sense Output Voltage Level to Ground</description>
							<lsb>8</lsb>
							<msb>8</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>VOUT</name>
									<description>Output Voltage is VOUT of Amplifier</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>GROUND</name>
									<description>Output Voltage is Ground of Feedback Network</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>GAIN</name>
							<description>OPA gain setting</description>
							<lsb>1</lsb>
							<msb>2</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value_0</name>
									<description>Gain_10</description>
									<value>0x0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value_1</name>
									<description>Gain_20</description>
									<value>0x1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value_2</name>
									<description>Gain_40</description>
									<value>0x2</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value_3</name>
									<description>Gain_60</description>
									<value>0x3</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>EN</name>
							<description>OPA enable</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>DISABLE</name>
									<description>OPA switched off</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENABLE</name>
									<description>OPA switched on</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>P2_ADCSEL_CTRL</name>
					<description>Port 2 ADC Selection Control Register</description>
					<addressOffset>0x00</addressOffset>
					<size>32</size>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>ADC1_CH1_SEL</name>
							<description>ADC1 Channel 1 Input Selection</description>
							<lsb>10</lsb>
							<msb>10</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>none</name>
									<description>Current Sense Amplifier disconnected from ADC1.Ch1</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CS_AMP</name>
									<description>Current Sense Amplifier is connected to ADC1.Ch1</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>ADC3_INN_SEL</name>
							<description>ADC3 Negative Input Selection</description>
							<lsb>9</lsb>
							<msb>9</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>none</name>
									<description>ADC3.N input disconnected</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Mux-Port 2.2</name>
									<description>Port 2.2 multiplexer is connected to ADC2.N</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>ADC3_INP_SEL</name>
							<description>ADC3 Positive Input Selection</description>
							<lsb>8</lsb>
							<msb>8</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>none</name>
									<description>ADC3.P input disconnected</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Mux-Port 2.0</name>
									<description>Port 2.0 multiplexer is connected to ADC3.P</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>P2_0_ADC_SEL</name>
							<description>Port 2.0 Input Selection</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>ADC10B</name>
									<description>Port 2.0 is connected to Channel 0 of ADC10B</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ADC3</name>
									<description>Port 2.0 is connected to IN_P of ADC3</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>P2_2_ADC_SEL</name>
							<description>Port 2.2 Input Selection</description>
							<lsb>1</lsb>
							<msb>1</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>ADC10B</name>
									<description>Port 2.2 is connected to Channel 2 of ADC10B</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ADC3</name>
									<description>Port 2.2 is connected to IN_N of ADC3</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>P2_3_ADC_SEL</name>
							<description>Port 2.3 Input Selection</description>
							<lsb>2</lsb>
							<msb>2</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>ADC1.Ch3</name>
									<description>Port 2.3 is connected to ADC1.Ch3</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>none</name>
									<description>ADC1.Ch3 disconnected from P2.3</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>P2_4_ADC_SEL</name>
							<description>Port 2.4 Input Selection</description>
							<lsb>3</lsb>
							<msb>3</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>ADC10B</name>
									<description>Port 2.4 is connected to Channel 4 of ADC10B</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ADC4</name>
									<description>.</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>P2_5_ADC_SEL</name>
							<description>Port 2.5 Input Selection</description>
							<lsb>4</lsb>
							<msb>4</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>ADC10B</name>
									<description>Port 2.5 is connected to Channel 5 of ADC10B</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ADC4</name>
									<description>.</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>REF1_STS</name>
					<description>Reference 1 Status Register</description>
					<addressOffset>0x14</addressOffset>
					<size>32</size>
					<resetValue>0x000000C1</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>REFBG_UPTHWARN_STS</name>
							<description>Status for Overvoltage Threshold Measurement of internal VAREF</description>
							<lsb>5</lsb>
							<msb>5</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>UPPER_TRIG_RESET</name>
									<description>write clears status</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>UPPER_TRIG_SET</name>
									<description>trigger status set</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>REFBG_LOTHWARN_STS</name>
							<description>Status for Undervoltage Threshold Measurement of internal VAREF</description>
							<lsb>4</lsb>
							<msb>4</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>UPPER_TRIG_RESET</name>
									<description>write clears status</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>UPPER_TRIG_SET</name>
									<description>trigger status set</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>REF2_CTRL</name>
					<description>Reference 2 Control Register</description>
					<addressOffset>0x18</addressOffset>
					<size>32</size>
					<resetValue>0x00000001</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>VREF5V_OV_STS</name>
							<description>ADC1 Bit Reference Voltage Generation Overvoltage Bit</description>
							<lsb>3</lsb>
							<msb>3</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>no_Overvoltage</name>
									<description>no Overvoltage detected</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Overvoltage</name>
									<description>Overvoltage detected</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>VREF5V_UV_STS</name>
							<description>ADC1 Bit Reference Voltage Generation Undervoltage Bit</description>
							<lsb>2</lsb>
							<msb>2</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>no_Undervoltage</name>
									<description>no Undervoltage detected</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Undervoltage</name>
									<description>Undervoltage detected</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>VREF5V_OVL_STS</name>
							<description>ADC1 Bit Reference Voltage Generation Over Load Bit</description>
							<lsb>1</lsb>
							<msb>1</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>no_OVERLOAD</name>
									<description>no OVERLOAD detected</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>OVERLOAD</name>
									<description>OVERLOAD detected</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>VREF5V_PD_N</name>
							<description>ADC1 Bit Reference Voltage Generation Power Down Bit</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>DISABLED</name>
									<description>Power Down</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ACTIVE</name>
									<description>no Power Down</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>TEMPSENSE_CTRL</name>
					<description>Temperature Sensor Control Register</description>
					<addressOffset>0x10</addressOffset>
					<size>32</size>
					<resetValue>0x00000003</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>SYS_OT_STS</name>
							<description>System Overtemperature (MU) Status</description>
							<lsb>7</lsb>
							<msb>7</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>INACTIVE</name>
									<description>write clears status</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ACTIVE</name>
									<description>interrupt status set</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>SYS_OTWARN_STS</name>
							<description>System Overtemperature Warning (MU) Status</description>
							<lsb>6</lsb>
							<msb>6</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>INACTIVE</name>
									<description>write clears status</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ACTIVE</name>
									<description>interrupt status set</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>PMU_OT_STS</name>
							<description>PMU Regulator Overtemperature (MU) Status</description>
							<lsb>5</lsb>
							<msb>5</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>INACTIVE</name>
									<description>write clears status</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ACTIVE</name>
									<description>interrupt status set</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>PMU_OTWARN_STS</name>
							<description>PMU Regulator Overtemperature Warning (MU) Status</description>
							<lsb>4</lsb>
							<msb>4</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>INACTIVE</name>
									<description>write clears status</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ACTIVE</name>
									<description>interrupt status set</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
