cmsis-svd/cmsis-svd/data/Infineon/TLE9879-2.svd
				<register>
					<name>TRIM_BEMFx</name>
					<description>Trimming of Driver</description>
					<addressOffset>0x20</addressOffset>
					<size>32</size>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>BEMF_TFILT_SEL</name>
							<description>Filter Time for BEMF Comparator Output Signal</description>
							<lsb>8</lsb>
							<msb>9</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>1_us</name>
									<description>1 us filter time</description>
									<value>0b00</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>2_us</name>
									<description>2 us filter time</description>
									<value>0b01</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>4_us</name>
									<description>4 us filter time</description>
									<value>0b10</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>8_us</name>
									<description>8 us filter time</description>
									<value>0b11</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>BEMF_GPT_CAPIN_SEL</name>
							<description>GPT12 CAPIN input selector</description>
							<lsb>4</lsb>
							<msb>5</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>SWTRIG</name>
									<description>software trigger</description>
									<value>0b00</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Phase_U</name>
									<description>trigger from Phase U</description>
									<value>0b01</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Phase_V</name>
									<description>trigger from Phase V</description>
									<value>0b10</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Phase_W</name>
									<description>trigger from Phase W</description>
									<value>0b11</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>BEMF_BT_TFILT_SEL</name>
							<description>Blanking Time for BEMF Comparator Output Signal</description>
							<lsb>0</lsb>
							<msb>2</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>6_us</name>
									<description>6 us filter time</description>
									<value>0b000</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>8_us</name>
									<description>8 us filter time</description>
									<value>0b001</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>12_us</name>
									<description>12 us filter time</description>
									<value>0b010</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>16_us</name>
									<description>16 us filter time</description>
									<value>0b011</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>3_us</name>
									<description>3 us filter time</description>
									<value>0b101</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>VMON_SEN_CTRL</name>
					<description>Supply Sense Control Register</description>
					<addressOffset>0x04</addressOffset>
					<size>32</size>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>VMON_SEN_SEL_INRANGE</name>
							<description>Monitoring Input Attenuator Select Inputrange</description>
							<lsb>5</lsb>
							<msb>5</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>range0</name>
									<description>0-18V range is selected</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>range1</name>
									<description>0-28V range is selected</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>VMON_SEN_HRESO_5V</name>
							<description>Monitoring Input Attenuator High Impedance Output Control</description>
							<lsb>4</lsb>
							<msb>4</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>High_Resistive_Output_Disable</name>
									<description>Connection to ADC input low ohmic</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>High_Resistive_Output_Enable</name>
									<description>Connection to ADC input high ohmic</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>VMON_SEN_PD_N</name>
							<description>Monitoring Input Attenuator enable</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>DISABLE</name>
									<description>Attenuator switched off</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENABLE</name>
									<description>Attenuator switched on</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
			</registers>
		</peripheral>
		<peripheral>
			<name>PMU</name>
			<description>Power Management Unit</description>
			<baseAddress>0x50004000</baseAddress>
			<addressBlock>
				<offset>0x0</offset>
				<size>0x1000</size>
				<usage>registers</usage>
			</addressBlock>
			<registers>
				<register>
					<name>CNF_CYC_SAMPLE_DEL</name>
					<description>Sample Delay in Cyclic Sense Register</description>
					<addressOffset>0x030</addressOffset>
					<size>32</size>
					<resetValue>#00000000</resetValue>
					<resetMask>#11111111</resetMask>
					<fields>
						<field>
							<name>M03</name>
							<description>Mantissa</description>
							<lsb>0</lsb>
							<msb>3</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>variable value M3M2M1M0 is 0</description>
									<value>0b0000</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>variable value M3M3M1M0 is 15</description>
									<value>0b1111</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>CNF_CYC_SENSE</name>
					<description>Dead Time in Cyclic Sense Register</description>
					<addressOffset>0x028</addressOffset>
					<size>32</size>
					<resetValue>#00000000</resetValue>
					<resetMask>#11111111</resetMask>
					<fields>
						<field>
							<name>OSC_100kHz_EN</name>
							<description>100 kHz Oscillator Enable</description>
							<lsb>7</lsb>
							<msb>7</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>DISABLE</name>
									<description>Oscillator is disabled</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENABLE</name>
									<description>Oscillator is enabled</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>E01</name>
							<description>Exponent</description>
							<lsb>4</lsb>
							<msb>5</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>Exponent value is 0</description>
									<value>0b00</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>Exponent value is 1</description>
									<value>0b01</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value3</name>
									<description>Exponent value is 2</description>
									<value>0b10</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value4</name>
									<description>Exponent value is 3</description>
									<value>0b11</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>M03</name>
							<description>Mantissa</description>
							<lsb>0</lsb>
							<msb>3</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>Mantissa value is 1</description>
									<value>0b0000</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>Mantissa value is 16</description>
									<value>0b1111</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>CNF_CYC_WAKE</name>
					<description>Dead Time in Cyclic Wake Register</description>
					<addressOffset>0x02C</addressOffset>
					<size>32</size>
					<resetValue>#00110111</resetValue>
					<resetMask>#11111111</resetMask>
					<fields>
						<field>
							<name>E01</name>
							<description>Exponent</description>
							<lsb>4</lsb>
							<msb>5</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>Exponent value is 0</description>
									<value>0b00</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>Exponent value is 1</description>
									<value>0b01</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value3</name>
									<description>Exponent value is 2</description>
									<value>0b10</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value4</name>
									<description>Exponent value is 3</description>
									<value>0b11</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>M03</name>
							<description>Mantissa</description>
							<lsb>0</lsb>
							<msb>3</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>Mantissa value is 1</description>
									<value>0b0000</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>Mntissa value is 16</description>
									<value>0b1111</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>CNF_PMU_SETTINGS</name>
					<description>PMU Settings Register</description>
					<addressOffset>0x020</addressOffset>
					<size>32</size>
					<resetValue>#00000100</resetValue>
					<resetMask>#11111111</resetMask>
					<fields>
						<field>
							<name>EN_VDDEXT_OC_OFF_N</name>
							<description>Disabling VDDEXT Shutdown in Overload Condition</description>
							<lsb>7</lsb>
							<msb>7</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>Shutdown enabled</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>Shutdown disabled</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>CYC_SENSE_EN</name>
							<description>Enabling Cyclic Sense</description>
							<lsb>3</lsb>
							<msb>3</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>Cyclic Sense disabled</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>Cyclic Sense enabled</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>CYC_WAKE_EN</name>
							<description>Enabling Cyclic Wake</description>
							<lsb>2</lsb>
							<msb>2</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>Cyclic Wake disabled</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>Cyclic Wake enabled</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>EN_0V9_N</name>
							<description>Disables the reduction of the VDDC regulator output to 0.9 V during Stop-Mode</description>
							<lsb>1</lsb>
							<msb>1</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>Output voltage reduction enabled</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>Output voltage reduction disabled</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>WAKE_W_RST</name>
							<description>Wake-up with reset execution</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>Stop-Exit without reset execution</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>Stop-Exit with reset execution</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>CNF_RST_TFB</name>
					<description>Reset Blind Time Register</description>
					<addressOffset>0x06C</addressOffset>
					<size>32</size>
					<resetValue>0x00000003</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>RST_TFB</name>
							<description>Reset Pin Blind Time Selection Bits</description>
							<lsb>0</lsb>
							<msb>1</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>RST_TFB_0</name>
									<description>0,5 us typ.</description>
									<value>0b00</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>RST_TFB_1</name>
									<description>1 us typ.</description>
									<value>0b01</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>RST_TFB_2</name>
									<description>5 us typ.</description>
									<value>0b10</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>RST_TFB_3</name>
									<description>31 us typ.</description>
									<value>0b11</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>CNF_WAKE_FILTER</name>
					<description>PMU Wake-up Timing Register</description>
					<addressOffset>0x0AC</addressOffset>
					<size>32</size>
					<resetValue>#00000000</resetValue>
					<resetMask>#11111111</resetMask>
					<fields>
						<field>
							<name>CNF_GPIO_FT</name>
							<description>Wake-up Filter time for General Purpose IO</description>
							<lsb>2</lsb>
							<msb>3</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>10_us</name>
									<description>10 us filter time</description>
									<value>0b00</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>20_us</name>
									<description>20 us filter time</description>
									<value>0b01</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>40_us</name>
									<description>40 us filter time</description>
									<value>0b10</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>5_us</name>
									<description>5 us filter time</description>
									<value>0b11</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>CNF_MON_FT</name>
							<description>Wake-up Filter time for Monitoring Inputs</description>
							<lsb>1</lsb>
							<msb>1</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>20_us</name>
									<description>20 us filter time</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>40_us</name>
									<description>40 us filter time</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>CNF_LIN_FT</name>
							<description>Wake-up Filter time for LIN WAKE</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>30_us</name>
									<description>30 us filter time</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>50_us</name>
									<description>50 us filter time</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>GPUDATA00</name>
					<description>General Purpose User DATA0</description>
					<addressOffset>0x0C0</addressOffset>
					<size>32</size>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>DATA0</name>
							<description>DATA0 Storage Byte</description>
							<lsb>0</lsb>
							<msb>7</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>GPUDATA01</name>
					<description>General Purpose User DATA1</description>
					<addressOffset>0x0C4</addressOffset>
					<size>32</size>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>DATA1</name>
							<description>DATA1 Storage Byte</description>
							<lsb>0</lsb>
							<msb>7</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>GPUDATA02</name>
					<description>General Purpose User DATA2</description>
					<addressOffset>0x0C8</addressOffset>
					<size>32</size>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>DATA2</name>
							<description>DATA2 Storage Byte</description>
							<lsb>0</lsb>
							<msb>7</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>GPUDATA03</name>
					<description>General Purpose User DATA3</description>
					<addressOffset>0x0CC</addressOffset>
					<size>32</size>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>DATA3</name>
							<description>DATA3 Storage Byte</description>
							<lsb>0</lsb>
							<msb>7</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>GPUDATA04</name>
					<description>General Purpose User DATA4</description>
					<addressOffset>0x0D0</addressOffset>
					<size>32</size>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>DATA4</name>
							<description>DATA4 Storage Byte</description>
							<lsb>0</lsb>
							<msb>7</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>GPUDATA05</name>
					<description>General Purpose User DATA5</description>
					<addressOffset>0x0D4</addressOffset>
					<size>32</size>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>DATA5</name>
							<description>DATA5 Storage Byte</description>
							<lsb>0</lsb>
							<msb>7</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>LIN_WAKE_EN</name>
					<description>LIN Wake Enable</description>
					<addressOffset>0x050</addressOffset>
					<size>32</size>
					<resetValue>#00000000</resetValue>
					<resetMask>#11111111</resetMask>
					<fields>
						<field>
							<name>LIN_EN</name>
							<description>Lin Wake enable</description>
							<lsb>7</lsb>
							<msb>7</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>Disable</name>
									<description>.</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Enable</name>
									<description>.</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
