cmsis-svd/cmsis-svd/data/Infineon/TLE9879-2.svd
				<register>
					<name>VDDEXT_CTRL</name>
					<description>VDDEXT Control</description>
					<addressOffset>0x08</addressOffset>
					<size>32</size>
					<resetValue>#00000000</resetValue>
					<resetMask>#00001111</resetMask>
					<fields>
						<field>
							<name>STABLE</name>
							<description>VDDEXT Supply works inside its specified range 1</description>
							<lsb>7</lsb>
							<msb>7</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>VDDEXT Voltage inside of specified range</description>
									<value>0b1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>VDDEXT Voltage outside of specified range</description>
									<value>0b0</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>OK</name>
							<description>VDDEXT Supply works inside its specified range 2</description>
							<lsb>6</lsb>
							<msb>6</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>VDDEXT in low drop mode</description>
									<value>0b1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>VDDEXT not in low drop mode</description>
									<value>0b0</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>OVERLOAD</name>
							<description>VDDEXT Supply Overload</description>
							<lsb>5</lsb>
							<msb>5</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>VDDEXT not in overload condition</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>VDDEXT in overload condition</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>OVERVOLT</name>
							<description>VDDEXT Supply Overvoltage</description>
							<lsb>4</lsb>
							<msb>4</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>VDDEXT not in overvoltage condition</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>VDDEXT in overvoltage condition</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>SHORT</name>
							<description>VDDEXT Supply Shorted Output</description>
							<lsb>3</lsb>
							<msb>3</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>VDDEXT no short circuit</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>VDDEXT short circuit</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>FAIL_EN</name>
							<description>Enabling of VDDEXT Supply status information as interrupt source</description>
							<lsb>2</lsb>
							<msb>2</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>VDDEXT fail interrupts are disabled</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>VDDEXT fail Interrupts are enabled</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>CYC_EN</name>
							<description>VDDEXT Supply for Cyclic Sense Enable</description>
							<lsb>1</lsb>
							<msb>1</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>VDDEXT for cyclic sense disable</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>VDDEXT for cyclic sense enable</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>ENABLE</name>
							<description>VDDEXT Supply Enable</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>VDDEXT Supply disabled</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>VDDEXT supply enabled</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>WAKE_CONF_GPIO0_CYC</name>
					<description>Wake Port 0 Cycle Enabled Register</description>
					<addressOffset>0xE0</addressOffset>
					<size>32</size>
					<resetValue>#00000000</resetValue>
					<resetMask>#11111111</resetMask>
					<fields>
						<field>
							<name>GPIO0_CYC_4</name>
							<description>GPIO0_4 input for cycle sense enable</description>
							<lsb>4</lsb>
							<msb>4</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>ENABLE</name>
									<description>input for cycle sense enabled</description>
									<value>0b1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>DISABLE</name>
									<description>input for cycle sense disabled</description>
									<value>0b0</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>GPIO0_CYC_3</name>
							<description>GPIO0_3 input for cycle sense enable</description>
							<lsb>3</lsb>
							<msb>3</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>ENABLE</name>
									<description>input for cycle sense enabled</description>
									<value>0b1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>DISABLE</name>
									<description>input for cycle sense disabled</description>
									<value>0b0</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>GPIO0_CYC_2</name>
							<description>GPIO0_2 input for cycle sense enable</description>
							<lsb>2</lsb>
							<msb>2</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>ENABLE</name>
									<description>input for cycle sense enabled</description>
									<value>0b1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>DISABLE</name>
									<description>input for cycle sense disabled</description>
									<value>0b0</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>GPIO0_CYC_1</name>
							<description>GPIO0_1 input for cycle sense enable</description>
							<lsb>1</lsb>
							<msb>1</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>ENABLE</name>
									<description>input for cycle sense enabled</description>
									<value>0b1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>DISABLE</name>
									<description>input for cycle sense disabled</description>
									<value>0b0</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>GPIO0_CYC_0</name>
							<description>GPIO0_0 input for cycle sense enable</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>ENABLE</name>
									<description>input for cycle sense enabled</description>
									<value>0b1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>DISABLE</name>
									<description>input for cycle sense disabled</description>
									<value>0b0</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>WAKE_CONF_GPIO0_FALL</name>
					<description>Wake Configuration GPIO Port 0 Falling Edge Register</description>
					<addressOffset>0xDC</addressOffset>
					<size>32</size>
					<resetValue>#00000000</resetValue>
					<resetMask>#11111111</resetMask>
					<fields>
						<field>
							<name>GPIO0_FA_4</name>
							<description>Port 0_4 Wake-up on Falling Edge enable</description>
							<lsb>4</lsb>
							<msb>4</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>ENABLE</name>
									<description>wake-up enabled</description>
									<value>0b1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>DISABLE</name>
									<description>wake-up disabled</description>
									<value>0b0</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>GPIO0_FA_3</name>
							<description>Port 0_3 Wake-up on Falling Edge enable</description>
							<lsb>3</lsb>
							<msb>3</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>ENABLE</name>
									<description>wake-up enabled</description>
									<value>0b1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>DISABLE</name>
									<description>wake-up disabled</description>
									<value>0b0</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>GPIO0_FA_2</name>
							<description>Port 0_2 Wake-up on Falling Edge enable</description>
							<lsb>2</lsb>
							<msb>2</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>ENABLE</name>
									<description>wake-up enabled</description>
									<value>0b1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>DISABLE</name>
									<description>wake-up disabled</description>
									<value>0b0</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>GPIO0_FA_1</name>
							<description>Port 0_1 Wake-up on Falling Edge enable</description>
							<lsb>1</lsb>
							<msb>1</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>ENABLE</name>
									<description>wake-up enabled</description>
									<value>0b1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>DISABLE</name>
									<description>wake-up disabled</description>
									<value>0b0</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>GPIO0_FA_0</name>
							<description>Port 0_0 Wake-up on Falling Edge enable</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>ENABLE</name>
									<description>wake-up enabled</description>
									<value>0b1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>DISABLE</name>
									<description>wake-up disabled</description>
									<value>0b0</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>WAKE_CONF_GPIO0_RISE</name>
					<description>Wake Configuration GPIO Port 0 Rising Edge Register</description>
					<addressOffset>0xD8</addressOffset>
					<size>32</size>
					<resetValue>#00000000</resetValue>
					<resetMask>#11111111</resetMask>
					<fields>
						<field>
							<name>GPIO0_RI_4</name>
							<description>Port 0_4 Wake-up on Rising Edge enable</description>
							<lsb>4</lsb>
							<msb>4</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>ENABLE</name>
									<description>wake-up enabled</description>
									<value>0b1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>DISABLE</name>
									<description>wake-up disabled</description>
									<value>0b0</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>GPIO0_RI_3</name>
							<description>Port 0_3 Wake-up on Rising Edge enable</description>
							<lsb>3</lsb>
							<msb>3</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>ENABLE</name>
									<description>wake-up enabled</description>
									<value>0b1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>DISABLE</name>
									<description>wake-up disabled</description>
									<value>0b0</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>GPIO0_RI_2</name>
							<description>Port 0_2 Wake-up on Rising Edge enable</description>
							<lsb>2</lsb>
							<msb>2</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>ENABLE</name>
									<description>wake-up enabled</description>
									<value>0b1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>DISABLE</name>
									<description>wake-up disabled</description>
									<value>0b0</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>GPIO0_RI_1</name>
							<description>Port 0_1 Wake-up on Rising Edge enable</description>
							<lsb>1</lsb>
							<msb>1</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>ENABLE</name>
									<description>wake-up enabled</description>
									<value>0b1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>DISABLE</name>
									<description>wake-up disabled</description>
									<value>0b0</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>GPIO0_RI_0</name>
							<description>Port 0_0 Wake-up on Rising Edge enable</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>ENABLE</name>
									<description>wake-up enabled</description>
									<value>0b1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>DISABLE</name>
									<description>wake-up disabled</description>
									<value>0b0</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>WAKE_CONF_GPIO1_CYC</name>
					<description>Wake Port 1 Cycle Enabled Register</description>
					<addressOffset>0xEC</addressOffset>
					<size>32</size>
					<resetValue>#00000000</resetValue>
					<resetMask>#11111111</resetMask>
					<fields>
						<field>
							<name>GPIO1_CYC_4</name>
							<description>GPIO1_4 input for cycle sense enable</description>
							<lsb>4</lsb>
							<msb>4</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>ENABLE</name>
									<description>input for cycle sense enabled</description>
									<value>0b1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>DISABLE</name>
									<description>input for cycle sense disabled</description>
									<value>0b0</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>GPIO1_CYC_3</name>
							<description>GPIO1_3 input for cycle sense enable</description>
							<lsb>3</lsb>
							<msb>3</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>ENABLE</name>
									<description>input for cycle sense enabled</description>
									<value>0b1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>DISABLE</name>
									<description>input for cycle sense disabled</description>
									<value>0b0</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>GPIO1_CYC_2</name>
							<description>GPIO1_2 input for cycle sense enable</description>
							<lsb>2</lsb>
							<msb>2</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>ENABLE</name>
									<description>input for cycle sense enabled</description>
									<value>0b1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>DISABLE</name>
									<description>input for cycle sense disabled</description>
									<value>0b0</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>GPIO1_CYC_1</name>
							<description>GPIO1_1 input for cycle sense enable</description>
							<lsb>1</lsb>
							<msb>1</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>ENABLE</name>
									<description>input for cycle sense enabled</description>
									<value>0b1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>DISABLE</name>
									<description>input for cycle sense disabled</description>
									<value>0b0</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>GPIO1_CYC_0</name>
							<description>GPIO1_0 input for cycle sense enable</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>ENABLE</name>
									<description>input for cycle sense enabled</description>
									<value>0b1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>DISABLE</name>
									<description>input for cycle sense disabled</description>
									<value>0b0</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>WAKE_CONF_GPIO1_FALL</name>
					<description>Wake Configuration GPIO Port 1 Falling Edge Register</description>
					<addressOffset>0xE8</addressOffset>
					<size>32</size>
					<resetValue>#00000000</resetValue>
					<resetMask>#11111111</resetMask>
					<fields>
						<field>
							<name>GPIO1_FA_4</name>
							<description>Port 1_4 Wake-up on Falling Edge enable</description>
							<lsb>4</lsb>
							<msb>4</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>ENABLE</name>
									<description>wake-up enabled</description>
									<value>0b1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>DISABLE</name>
									<description>wake-up disabled</description>
									<value>0b0</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>GPIO1_FA_3</name>
							<description>Port 1_3 Wake-up on Falling Edge enable</description>
							<lsb>3</lsb>
							<msb>3</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>ENABLE</name>
									<description>wake-up enabled</description>
									<value>0b1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>DISABLE</name>
									<description>wake-up disabled</description>
									<value>0b0</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>GPIO1_FA_2</name>
							<description>Port 1_2 Wake-up on Falling Edge enable</description>
							<lsb>2</lsb>
							<msb>2</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>ENABLE</name>
									<description>wake-up enabled</description>
									<value>0b1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>DISABLE</name>
									<description>wake-up disabled</description>
									<value>0b0</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>GPIO1_FA_1</name>
							<description>Port 1_1 Wake-up on Falling Edge enable</description>
							<lsb>1</lsb>
							<msb>1</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>ENABLE</name>
									<description>wake-up enabled</description>
									<value>0b1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>DISABLE</name>
									<description>wake-up disabled</description>
									<value>0b0</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>GPIO1_FA_0</name>
							<description>Port 1_0 Wake-up on Falling Edge enable</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>ENABLE</name>
									<description>wake-up enabled</description>
									<value>0b1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>DISABLE</name>
									<description>wake-up disabled</description>
									<value>0b0</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
