cmsis-svd/cmsis-svd/data/Infineon/TLE9879-2.svd
				<register>
					<name>WAKE_CONF_GPIO1_RISE</name>
					<description>Wake Configuration GPIO Port 1 Rising Edge Register</description>
					<addressOffset>0xE4</addressOffset>
					<size>32</size>
					<resetValue>#00000000</resetValue>
					<resetMask>#11111111</resetMask>
					<fields>
						<field>
							<name>GPIO1_RI_4</name>
							<description>Port 1_4 Wake-up on Rising Edge enable</description>
							<lsb>4</lsb>
							<msb>4</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>ENABLE</name>
									<description>wake-up enabled</description>
									<value>0b1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>DISABLE</name>
									<description>wake-up disabled</description>
									<value>0b0</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>GPIO1_RI_3</name>
							<description>Port 1_3 Wake-up on Rising Edge enable</description>
							<lsb>3</lsb>
							<msb>3</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>ENABLE</name>
									<description>wake-up enabled</description>
									<value>0b1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>DISABLE</name>
									<description>wake-up disabled</description>
									<value>0b0</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>GPIO1_RI_2</name>
							<description>Port 1_2 Wake-up on Rising Edge enable</description>
							<lsb>2</lsb>
							<msb>2</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>ENABLE</name>
									<description>wake-up enabled</description>
									<value>0b1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>DISABLE</name>
									<description>wake-up disabled</description>
									<value>0b0</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>GPIO1_RI_1</name>
							<description>Port 1_1 Wake-up on Rising Edge enable</description>
							<lsb>1</lsb>
							<msb>1</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>ENABLE</name>
									<description>wake-up enabled</description>
									<value>0b1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>DISABLE</name>
									<description>wake-up disabled</description>
									<value>0b0</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>GPIO1_RI_0</name>
							<description>Port 1_0 Wake-up on Rising Edge enable</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>ENABLE</name>
									<description>wake-up enabled</description>
									<value>0b1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>DISABLE</name>
									<description>wake-up disabled</description>
									<value>0b0</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>WAKE_STATUS</name>
					<description>Main wake status register</description>
					<addressOffset>0x000</addressOffset>
					<size>32</size>
					<resetValue>#00000000</resetValue>
					<resetMask>#11000000</resetMask>
					<fields>
						<field>
							<name>FAIL</name>
							<description>Wake-up after VDDEXT Fail</description>
							<lsb>5</lsb>
							<msb>5</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>No Wake-up occurred</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>Wake-up occurred</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>CYC_WAKE</name>
							<description>Wake-up caused by Cyclic Wake</description>
							<lsb>4</lsb>
							<msb>4</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>No Wake-up occurred</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>Wake-up occurred</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>GPIO1</name>
							<description>Wake-up via GPIO1 which is a logical OR combination of all Wake_STS_GPIO1 bits</description>
							<lsb>3</lsb>
							<msb>3</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>No Wake-up occurred</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>Wake-up occurred</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>GPIO0</name>
							<description>Wake-up via GPIO0 which is a logical OR combination of all Wake_STS_GPIO0 bits</description>
							<lsb>2</lsb>
							<msb>2</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>No Wake-up occurred</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>Wake-up occurred</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>MON_WAKE</name>
							<description>Wake-up via MON</description>
							<lsb>1</lsb>
							<msb>1</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>No Wake-up occurred</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>Wake-up occurred</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>LIN_WAKE</name>
							<description>Wake-up via LIN- Message</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>No Wake-up occurred</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>Wake-up occurred</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>WAKE_STS_FAIL</name>
					<description>Wake Status Fail Register</description>
					<addressOffset>0x080</addressOffset>
					<size>32</size>
					<resetValue>#00000000</resetValue>
					<resetMask>#11111111</resetMask>
					<fields>
						<field>
							<name>VDDEXTSHORT</name>
							<description>Stop-Exit due to short circuit at the VDDEXT Supply</description>
							<lsb>2</lsb>
							<msb>2</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>No short circuit</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>Short circuit</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>SUPPFAIL</name>
							<description>Stop-Exit due to overvoltage at the VDDEXT Supply</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>No overvoltage</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>Module suspend enabled</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>WAKE_STS_GPIO0</name>
					<description>Wake Status GPIO 0 Register</description>
					<addressOffset>0x088</addressOffset>
					<size>32</size>
					<resetValue>#00000000</resetValue>
					<resetMask>#11111111</resetMask>
					<fields>
						<field>
							<name>GPIO0_STS_4</name>
							<description>Status of GPIO0_4</description>
							<lsb>4</lsb>
							<msb>4</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>No_wake_up_detected</name>
									<description>.</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>wake_up_detected</name>
									<description>.</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>GPIO0_STS_3</name>
							<description>Status of GPIO0_3</description>
							<lsb>3</lsb>
							<msb>3</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>No_wake_up_detected</name>
									<description>.</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>wake_up_detected</name>
									<description>.</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>GPIO0_STS_2</name>
							<description>Status of GPIO0_2</description>
							<lsb>2</lsb>
							<msb>2</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>No_wake_up_detected</name>
									<description>.</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>wake_up_detected</name>
									<description>.</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>GPIO0_STS_1</name>
							<description>Status of GPIO0_1</description>
							<lsb>1</lsb>
							<msb>1</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>No_wake_up_detected</name>
									<description>.</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>wake_up_detected</name>
									<description>.</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>GPIO0_STS_0</name>
							<description>Status of GPIO0_0</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>No_wake_up_detected</name>
									<description>.</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>wake_up_detected</name>
									<description>.</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>WAKE_STS_GPIO1</name>
					<description>Wake Status GPIO 1 Register</description>
					<addressOffset>0x08C</addressOffset>
					<size>32</size>
					<resetValue>#00000000</resetValue>
					<resetMask>#11111111</resetMask>
					<fields>
						<field>
							<name>GPIO1_STS_4</name>
							<description>Wake GPIO1_4</description>
							<lsb>4</lsb>
							<msb>4</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>No_wake_up_detected</name>
									<description>.</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>wake_up_detected</name>
									<description>.</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>GPIO1_STS_3</name>
							<description>Wake GPIO1_3</description>
							<lsb>3</lsb>
							<msb>3</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>No_wake_up_detected</name>
									<description>.</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>wake_up_detected</name>
									<description>.</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>GPIO1_STS_2</name>
							<description>Wake GPIO1_2</description>
							<lsb>2</lsb>
							<msb>2</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>No_wake_up_detected</name>
									<description>.</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>wake_up_detected</name>
									<description>.</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>GPIO1_STS_1</name>
							<description>Wake GPIO1_1</description>
							<lsb>1</lsb>
							<msb>1</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>No_wake_up_detected</name>
									<description>.</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>wake_up_detected</name>
									<description>.</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>GPIO1_STS_0</name>
							<description>Wake GPIO1_0</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>No_wake_up_detected</name>
									<description>.</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>wake_up_detected</name>
									<description>.</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>WAKE_STS_MON</name>
					<description>Wake Source MON Input Register</description>
					<addressOffset>0x084</addressOffset>
					<size>32</size>
					<resetValue>#00000000</resetValue>
					<resetMask>#11111111</resetMask>
					<fields>
						<field>
							<name>WAKE_STS</name>
							<description>Status of MON</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>No_wake_up_detected</name>
									<description>.</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>wake_up_detected</name>
									<description>.</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
