cmsis-svd/cmsis-svd/data/Infineon/TLE9879-2.svd
				<register>
					<name>BGL2</name>
					<description>Baud Rate Timer/Reload Register, Low Byte 2, RESET_TYPE_3</description>
					<addressOffset>0x09C</addressOffset>
					<size>32</size>
					<resetValue>0x00</resetValue>
					<resetMask>0xFF</resetMask>
					<fields>
						<field>
							<name>FD_SEL</name>
							<description>Fractional Divider Selection</description>
							<lsb>0</lsb>
							<msb>4</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>BR_VALUE</name>
							<description>Baud Rate Timer/Reload Value</description>
							<lsb>5</lsb>
							<msb>7</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>CMCON1</name>
					<description>Clock Control Register 1, RESET_TYPE_4</description>
					<addressOffset>0x048</addressOffset>
					<size>32</size>
					<resetValue>0x00</resetValue>
					<resetMask>0xFF</resetMask>
					<fields>
						<field>
							<name>VCOSEL</name>
							<description>VCOSEL Setting</description>
							<lsb>7</lsb>
							<msb>7</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>VCOSEL = 0</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>VCOSEL = 1</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>K1DIV</name>
							<description>PLL K1-Divider</description>
							<lsb>6</lsb>
							<msb>6</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>K1 = 2</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>K1 = 1</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>K2DIV</name>
							<description>PLL K2-Divider</description>
							<lsb>4</lsb>
							<msb>5</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>K2 = 2</description>
									<value>0b00</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>K2 = 3</description>
									<value>0b01</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value3</name>
									<description>K2 = 4</description>
									<value>0b10</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value4</name>
									<description>K2 = 5</description>
									<value>0b11</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>CLKREL</name>
							<description>Slow Down Clock Divider for fCCLK Generation</description>
							<lsb>0</lsb>
							<msb>3</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>fsys</description>
									<value>0b0000</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>fsys/2</description>
									<value>0b0001</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value3</name>
									<description>fsys/3</description>
									<value>0b0010</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value4</name>
									<description>fsys/4</description>
									<value>0b0011</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value5</name>
									<description>fsys/8</description>
									<value>0b0100</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value6</name>
									<description>fsys/16</description>
									<value>0b0101</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value7</name>
									<description>fsys/24</description>
									<value>0b0110</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value8</name>
									<description>fsys/32</description>
									<value>0b0111</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value9</name>
									<description>fsys/48</description>
									<value>0b1000</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value10</name>
									<description>fsys/64</description>
									<value>0b1001</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value11</name>
									<description>fsys/96</description>
									<value>0b1010</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value12</name>
									<description>fsys/128</description>
									<value>0b1011</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value13</name>
									<description>fsys/192</description>
									<value>0b1100</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value14</name>
									<description>fsys/256</description>
									<value>0b1101</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value15</name>
									<description>fsys/384</description>
									<value>0b1110</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value16</name>
									<description>fsys/512</description>
									<value>0b1111</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>CMCON2</name>
					<description>Clock Control Register 2, RESET_TYPE_4</description>
					<addressOffset>0x04C</addressOffset>
					<size>32</size>
					<resetValue>0x00</resetValue>
					<resetMask>0xFF</resetMask>
					<fields>
						<field>
							<name>PBA0CLKREL</name>
							<description>PBA0 Clock Divider</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>divide by 1</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>divide by 2</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>COCON</name>
					<description>Clock Output Control Register, RESET_TYPE_4</description>
					<addressOffset>0x0B4</addressOffset>
					<size>32</size>
					<resetValue>0x00</resetValue>
					<resetMask>0xFF</resetMask>
					<fields>
						<field>
							<name>EN</name>
							<description>CLKOUT Enable</description>
							<lsb>7</lsb>
							<msb>7</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>No external clock signal is provided</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>The configured external clock signal is provided</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>COUTS1</name>
							<description>Clock Out Source Select Bit 1</description>
							<lsb>6</lsb>
							<msb>6</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>fCCLK is selected.</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>Based on setting of COUTS0.</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>TLEN</name>
							<description>Toggle Latch Enable</description>
							<lsb>5</lsb>
							<msb>5</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>Toggle Latch is disabled. Clock output frequency is chosen by the bit field COREL.</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>Toggle Latch is enabled. Clock output frequency is half of the frequency that is chosen by the bit field COREL. The resulting output frequency has 50 percent70 duty cycle.</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>COUTS0</name>
							<description>Clock Out Source Select Bit 0</description>
							<lsb>4</lsb>
							<msb>4</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>Oscillator output frequency is selected.</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>Clock output frequency is chosen by the bit field COREL.</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>COREL</name>
							<description>Clock Output Divider</description>
							<lsb>0</lsb>
							<msb>3</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>fsys</description>
									<value>0b0000</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>fsys/2</description>
									<value>0b0001</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value3</name>
									<description>fsys/3</description>
									<value>0b0010</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value4</name>
									<description>fsys/4</description>
									<value>0b0011</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value5</name>
									<description>fsys/6</description>
									<value>0b0100</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value6</name>
									<description>fsys/8</description>
									<value>0b0101</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value7</name>
									<description>fsys/10</description>
									<value>0b0110</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value8</name>
									<description>fsys/12</description>
									<value>0b0111</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value9</name>
									<description>fsys/14</description>
									<value>0b1000</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value10</name>
									<description>fsys/16</description>
									<value>0b1001</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value11</name>
									<description>fsys/18</description>
									<value>0b1010</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value12</name>
									<description>fsys/20</description>
									<value>0b1011</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value13</name>
									<description>fsys/24</description>
									<value>0b1100</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value14</name>
									<description>fsys/32</description>
									<value>0b1101</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value15</name>
									<description>fsys/36</description>
									<value>0b1110</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value16</name>
									<description>fsys/40</description>
									<value>0b1111</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>DMAIEN1</name>
					<description>DMA Interrupt Enable Register 1, RESET_TYPE_3</description>
					<addressOffset>0x144</addressOffset>
					<size>32</size>
					<resetValue>0x00</resetValue>
					<resetMask>0xFF</resetMask>
					<fields>
						<field>
							<name>CH8IE</name>
							<description>DMA Channel 11 Interrupt Enable (ADC1 Channel 7)</description>
							<lsb>7</lsb>
							<msb>7</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>Interrupt is disabled</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>Interrupt is enabled</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>CH7IE</name>
							<description>DMA Channel 10 Interrupt Enable (ADC1 Channel 6)</description>
							<lsb>6</lsb>
							<msb>6</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>Interrupt is disabled</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>Interrupt is enabled</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>CH6IE</name>
							<description>DMA Channel 9 Interrupt Enable (ADC1 Channel 5)</description>
							<lsb>5</lsb>
							<msb>5</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>Interrupt is disabled</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>Interrupt is enabled</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>CH5IE</name>
							<description>DMA Channel 8 Interrupt Enable (ADC1 Channel 4)</description>
							<lsb>4</lsb>
							<msb>4</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>Interrupt is disabled</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>Interrupt is enabled</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>CH4IE</name>
							<description>DMA Channel 7 Interrupt Enable (ADC1 Channel 3)</description>
							<lsb>3</lsb>
							<msb>3</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>Interrupt is disabled</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>Interrupt is enabled</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>CH3IE</name>
							<description>DMA Channel 6 Interrupt Enable (ADC1 Channel 2)</description>
							<lsb>2</lsb>
							<msb>2</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>Interrupt is disabled</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>Interrupt is enabled</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>CH2IE</name>
							<description>DMA Channel 5 Interrupt Enable (ADC1 Channel 1)</description>
							<lsb>1</lsb>
							<msb>1</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>Interrupt is disabled</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>Interrupt is enabled</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>CH1IE</name>
							<description>DMA Channel 4 Interrupt Enable (ADC1 Channel 0)</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>Interrupt is disabled</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>Interrupt is enabled</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>DMAIEN2</name>
					<description>DMA Interrupt Enable Register 2, RESET_TYPE_3</description>
					<addressOffset>0x148</addressOffset>
					<size>32</size>
					<resetValue>0x00</resetValue>
					<resetMask>0xFF</resetMask>
					<fields>
						<field>
							<name>SDADCIE</name>
							<description>DMA Channel 13 Interrupt Enable (SDADC)</description>
							<lsb>6</lsb>
							<msb>6</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>Interrupt is disabled</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>Interrupt is enabled</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>GPT12IE</name>
							<description>DMA Channel 12 Interrupt Enable (GPT12/Timer3)</description>
							<lsb>5</lsb>
							<msb>5</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>Interrupt is disabled</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>Interrupt is enabled</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>SSCRXIE</name>
							<description>DMA Channel 3 Interrupt Enable (SSCx Receive)</description>
							<lsb>4</lsb>
							<msb>4</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>Interrupt is disabled</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>Interrupt is enabled</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>SSCTXIE</name>
							<description>DMA Channel 2 Interrupt Enable (SSCx Transmit)</description>
							<lsb>3</lsb>
							<msb>3</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>Interrupt is disabled</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>Interrupt is enabled</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>TRSEQ2RDYIE</name>
							<description>DMA Channel 1 Interrupt Enable (ADC1 ESM)</description>
							<lsb>2</lsb>
							<msb>2</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>Interrupt is disabled</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>Interrupt is enabled</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>TRSEQ1RDYIE</name>
							<description>DMA Channel 0 Interrupt Enable (ADC1 Sequence)</description>
							<lsb>1</lsb>
							<msb>1</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>Interrupt is disabled</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>Interrupt is enabled</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>TRERRIE</name>
							<description>DMA Transfer Error Interrupt Enable</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>Interrupt is disabled</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>Interrupt is enabled</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
