cmsis-svd/cmsis-svd/data/Infineon/TLE9879-2.svd
				<register>
					<name>P0_POCON1</name>
					<description>Port Output Control Register, RESET_TYPE_3</description>
					<addressOffset>0x0EC</addressOffset>
					<size>32</size>
					<resetValue>0x44</resetValue>
					<resetMask>0xFF</resetMask>
					<fields>
						<field>
							<name>PDM3</name>
							<description>P0.3 Port Driver Mode</description>
							<lsb>4</lsb>
							<msb>6</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>Not used</description>
									<value>0b000</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>Not used</description>
									<value>0b001</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value3</name>
									<description>Not Used</description>
									<value>0b010</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value4</name>
									<description>Weak driver</description>
									<value>0b011</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value5</name>
									<description>Medium driver</description>
									<value>0b100</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value6</name>
									<description>Medium driver</description>
									<value>0b101</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value7</name>
									<description>Medium driver</description>
									<value>0b110</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value8</name>
									<description>Weak driver</description>
									<value>0b111</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>PDM2</name>
							<description>P0.2 Port Driver Mode</description>
							<lsb>0</lsb>
							<msb>2</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>Strong driver and sharp edge mode</description>
									<value>0b000</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>Strong driver and medium edge mode</description>
									<value>0b001</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value3</name>
									<description>Strong driver and soft edge mode</description>
									<value>0b010</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value4</name>
									<description>Weak driver</description>
									<value>0b011</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value5</name>
									<description>Medium driver</description>
									<value>0b100</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value6</name>
									<description>Medium driver</description>
									<value>0b101</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value7</name>
									<description>Medium driver</description>
									<value>0b110</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value8</name>
									<description>Weak driver</description>
									<value>0b111</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>P0_POCON2</name>
					<description>Port Output Control Register, RESET_TYPE_3</description>
					<addressOffset>0x0F0</addressOffset>
					<size>32</size>
					<resetValue>0x44</resetValue>
					<resetMask>0xFF</resetMask>
					<fields>
						<field>
							<name>PDM4</name>
							<description>P0.4 Port Driver Mode</description>
							<lsb>0</lsb>
							<msb>2</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>Not used</description>
									<value>0b000</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>Not used</description>
									<value>0b001</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value3</name>
									<description>Not Used</description>
									<value>0b010</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value4</name>
									<description>Weak driver</description>
									<value>0b011</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value5</name>
									<description>Medium driver</description>
									<value>0b100</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value6</name>
									<description>Medium driver</description>
									<value>0b101</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value7</name>
									<description>Medium driver</description>
									<value>0b110</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value8</name>
									<description>Weak driver</description>
									<value>0b111</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>P1_POCON0</name>
					<description>Port Output Control Register, RESET_TYPE_3</description>
					<addressOffset>0x0F8</addressOffset>
					<size>32</size>
					<resetValue>0x44</resetValue>
					<resetMask>0xFF</resetMask>
					<fields>
						<field>
							<name>PDM1</name>
							<description>P1.1 Port Driver Mode</description>
							<lsb>4</lsb>
							<msb>6</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>Not used</description>
									<value>0b000</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>Not used</description>
									<value>0b001</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value3</name>
									<description>Not Used</description>
									<value>0b010</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value4</name>
									<description>Weak driver</description>
									<value>0b011</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value5</name>
									<description>Medium driver</description>
									<value>0b100</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value6</name>
									<description>Medium driver</description>
									<value>0b101</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value7</name>
									<description>Medium driver</description>
									<value>0b110</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value8</name>
									<description>Weak driver</description>
									<value>0b111</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>PDM0</name>
							<description>P1.0 Port Driver Mode</description>
							<lsb>0</lsb>
							<msb>2</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>Not used</description>
									<value>0b000</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>Not used</description>
									<value>0b001</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value3</name>
									<description>Not Used</description>
									<value>0b010</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value4</name>
									<description>Weak driver</description>
									<value>0b011</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value5</name>
									<description>Medium driver</description>
									<value>0b100</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value6</name>
									<description>Medium driver</description>
									<value>0b101</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value7</name>
									<description>Medium driver</description>
									<value>0b110</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value8</name>
									<description>Weak driver</description>
									<value>0b111</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>P1_POCON1</name>
					<description>Port Output Control Register, RESET_TYPE_3</description>
					<addressOffset>0x0FC</addressOffset>
					<size>32</size>
					<resetValue>0x44</resetValue>
					<resetMask>0xFF</resetMask>
					<fields>
						<field>
							<name>PDM3</name>
							<description>P1.3 Port Driver Mode</description>
							<lsb>4</lsb>
							<msb>6</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>Strong driver and sharp edge mode</description>
									<value>0b000</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>Strong driver and medium edge mode</description>
									<value>0b001</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value3</name>
									<description>Strong driver and soft edge mode</description>
									<value>0b010</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value4</name>
									<description>Weak driver</description>
									<value>0b011</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value5</name>
									<description>Medium driver</description>
									<value>0b100</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value6</name>
									<description>Medium driver</description>
									<value>0b101</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value7</name>
									<description>Medium driver</description>
									<value>0b110</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value8</name>
									<description>Weak driver</description>
									<value>0b111</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>PDM2</name>
							<description>P1.2 Port Driver Mode</description>
							<lsb>0</lsb>
							<msb>2</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>Not used</description>
									<value>0b000</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>Not used</description>
									<value>0b001</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value3</name>
									<description>Not Used</description>
									<value>0b010</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value4</name>
									<description>Weak driver</description>
									<value>0b011</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value5</name>
									<description>Medium driver</description>
									<value>0b100</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value6</name>
									<description>Medium driver</description>
									<value>0b101</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value7</name>
									<description>Medium driver</description>
									<value>0b110</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value8</name>
									<description>Weak driver</description>
									<value>0b111</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>P1_POCON2</name>
					<description>Port Output Control Register, RESET_TYPE_3</description>
					<addressOffset>0x100</addressOffset>
					<size>32</size>
					<resetValue>0x04</resetValue>
					<resetMask>0xFF</resetMask>
					<fields>
						<field>
							<name>PDM4</name>
							<description>P1.4 Port Driver Mode</description>
							<lsb>0</lsb>
							<msb>2</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>Strong driver and sharp edge mode</description>
									<value>0b000</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>Strong driver and medium edge mode</description>
									<value>0b001</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value3</name>
									<description>Strong driver and soft edge mode</description>
									<value>0b010</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value4</name>
									<description>Weak driver</description>
									<value>0b011</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value5</name>
									<description>Medium driver</description>
									<value>0b100</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value6</name>
									<description>Medium driver</description>
									<value>0b101</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value7</name>
									<description>Medium driver</description>
									<value>0b110</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value8</name>
									<description>Weak driver</description>
									<value>0b111</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>PASSWD</name>
					<description>Password Register, RESET_TYPE_3</description>
					<addressOffset>0x0AC</addressOffset>
					<size>32</size>
					<resetValue>0x07</resetValue>
					<resetMask>0xFF</resetMask>
					<fields>
						<field>
							<name>PASS</name>
							<description>Password Bits</description>
							<lsb>3</lsb>
							<msb>7</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>Enables writing of the bit field MODE.</description>
									<value>0b11000</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>Opens access to writing of all protected bits.</description>
									<value>0b10011</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value3</name>
									<description>Closes access to writing of all protected bits.</description>
									<value>0b10101</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>PROTECT_S</name>
							<description>Bit-Protection Signal Status Bit</description>
							<lsb>2</lsb>
							<msb>2</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>Software is able to write to all protected bits.</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>Software is unable to write to any protected bits.</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>MODE</name>
							<description>Bit-Protection Scheme Control Bit</description>
							<lsb>0</lsb>
							<msb>1</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>Scheme Disabled</description>
									<value>0b00</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>Scheme Enabled (default)</description>
									<value>0b11</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>PLL_CON</name>
					<description>PLL Control Register, RESET_TYPE_4</description>
					<addressOffset>0x044</addressOffset>
					<size>32</size>
					<resetValue>0x64</resetValue>
					<resetMask>0xFF</resetMask>
					<fields>
						<field>
							<name>NDIV</name>
							<description>PLL N-Divider</description>
							<lsb>4</lsb>
							<msb>7</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>N = 8</description>
									<value>0b0000</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>N = 9</description>
									<value>0b0001</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value3</name>
									<description>N = 10</description>
									<value>0b0010</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value4</name>
									<description>N = 12</description>
									<value>0b0011</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value5</name>
									<description>N = 14</description>
									<value>0b0100</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value6</name>
									<description>N = 15</description>
									<value>0b0101</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value7</name>
									<description>N = 16 (default)</description>
									<value>0b0110</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value8</name>
									<description>N = 18</description>
									<value>0b0111</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value9</name>
									<description>N = 20</description>
									<value>0b1000</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value10</name>
									<description>N = 21</description>
									<value>0b1001</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value11</name>
									<description>N = 22</description>
									<value>0b1010</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value12</name>
									<description>N = 24</description>
									<value>0b1011</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value13</name>
									<description>N = 25</description>
									<value>0b1100</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value14</name>
									<description>N = 26</description>
									<value>0b1101</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value15</name>
									<description>N = 27</description>
									<value>0b1110</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value16</name>
									<description>N = 28</description>
									<value>0b1111</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>VCOBYP</name>
							<description>PLL VCO Bypass Mode Select</description>
							<lsb>3</lsb>
							<msb>3</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>Normal (or freerunning) operation (default)</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>Prescaler Mode; VCO is bypassed (PLL output clock is derived from input clock divided by K1-divider)</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>OSCDISC</name>
							<description>Oscillator Disconnect</description>
							<lsb>2</lsb>
							<msb>2</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>Oscillator is connected to the PLL</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>Oscillator is disconnected to the PLL.</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>RESLD</name>
							<description>Restart Lock Detection</description>
							<lsb>1</lsb>
							<msb>1</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>No effect.</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>Reset lock flag and restart lock detection.</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>LOCK</name>
							<description>PLL Lock Status Flag</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>The frequency difference of fREF and fDIV is greater than allowed. The VCO part of the PLL can not lock on a target frequency.</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>The frequency difference of fREF and fDIV is small enough to enable a stable VCO operation.</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
