cmsis-svd/cmsis-svd/data/Infineon/TLE9879-2.svd
				<register>
					<name>BDRV_ISCLR</name>
					<description>Bridge Driver Interrrupt Status Clear</description>
					<addressOffset>0x54</addressOffset>
					<size>32</size>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>VSD_UPTH_SCLR</name>
							<description>Warning for VSD Upper Threshold Measurement (ADC2 channel 6) Status</description>
							<lsb>28</lsb>
							<msb>28</msb>
							<access>write-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>INACTIVE</name>
									<description>no overvoltage status set</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ACTIVE</name>
									<description>overvoltage status set</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>VSD_LOWTH_SCLR</name>
							<description>Warning for VSD Lower Threshold Measurement (ADC2 channel 6) Status</description>
							<lsb>27</lsb>
							<msb>27</msb>
							<access>write-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>INACTIVE</name>
									<description>no undervoltage status set</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ACTIVE</name>
									<description>undervoltage status set</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>VCP_UPTH_SCLR</name>
							<description>Warning for VCP Upper Threshold Measurement (ADC2 channel 7) Status</description>
							<lsb>26</lsb>
							<msb>26</msb>
							<access>write-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>INACTIVE</name>
									<description>no overvoltage status set</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ACTIVE</name>
									<description>overvoltage status set</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>VCP_LOWTH1_SCLR</name>
							<description>Warning for VCP Lower Threshold 1 Measurement (ADC2 channel 7) Status</description>
							<lsb>25</lsb>
							<msb>25</msb>
							<access>write-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>INACTIVE</name>
									<description>no undervoltage status set</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ACTIVE</name>
									<description>undervoltage status set</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>VCP_LOWTH2_SCLR</name>
							<description>Warning for VCP Lower Threshold 2 Measurement (VCP_LOW Signal from CP) Status</description>
							<lsb>24</lsb>
							<msb>24</msb>
							<access>write-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>INACTIVE</name>
									<description>no undervoltage status set</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ACTIVE</name>
									<description>undervoltage status set</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>VSD_UPTH_ICLR</name>
							<description>Warning for VSD Upper Threshold Measurement (ADC2 channel 6) Interrupt Status</description>
							<lsb>20</lsb>
							<msb>20</msb>
							<access>write-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>INACTIVE</name>
									<description>no interrupt status set</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ACTIVE</name>
									<description>interrupt status set</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>VSD_LOWTH_ICLR</name>
							<description>Warning for VSD Lower Threshold Measurement (ADC2 channel 6) Interrupt Status</description>
							<lsb>19</lsb>
							<msb>19</msb>
							<access>write-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>INACTIVE</name>
									<description>no interrupt status set</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ACTIVE</name>
									<description>interrupt status set</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>VCP_UPTH_ICLR</name>
							<description>Warning for VCP Upper Threshold Measurement (ADC2 channel 7) Interrupt Status</description>
							<lsb>18</lsb>
							<msb>18</msb>
							<access>write-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>INACTIVE</name>
									<description>no interrupt status set</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ACTIVE</name>
									<description>interrupt status set</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>VCP_LOWTH1_ICLR</name>
							<description>Warning for VCP Lower Threshold 1 Measurement (ADC2 channel 7) Interrupt Status</description>
							<lsb>17</lsb>
							<msb>17</msb>
							<access>write-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>INACTIVE</name>
									<description>no interrupt status set</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ACTIVE</name>
									<description>interrupt status set</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>VCP_LOWTH2_ICLR</name>
							<description>Warning for VCP Lower Threshold 2 Measurement (VCP_LOW Signal from CP) Interrupt Status</description>
							<lsb>16</lsb>
							<msb>16</msb>
							<access>write-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>INACTIVE</name>
									<description>no interrupt status set</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ACTIVE</name>
									<description>interrupt status set</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>HS3_OC_ICLR</name>
							<description>External High Side 3 FET Over-current Status</description>
							<lsb>15</lsb>
							<msb>15</msb>
							<access>write-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>INACTIVE</name>
									<description>no interrupt status set.</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ACTIVE</name>
									<description>at least one interrupt status set.</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>LS3_OC_ICLR</name>
							<description>External Low Side 3 FET Over-current Status</description>
							<lsb>14</lsb>
							<msb>14</msb>
							<access>write-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>INACTIVE</name>
									<description>no interrupt status set.</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ACTIVE</name>
									<description>at least one interrupt status set.</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>HS2_OC_ICLR</name>
							<description>External High Side 2 FET Over-current Status</description>
							<lsb>13</lsb>
							<msb>13</msb>
							<access>write-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>INACTIVE</name>
									<description>no interrupt status set.</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ACTIVE</name>
									<description>at least one interrupt status set.</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>HS1_OC_ICLR</name>
							<description>External High 1 FET Over-current Status</description>
							<lsb>12</lsb>
							<msb>12</msb>
							<access>write-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>INACTIVE</name>
									<description>no interrupt status set.</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ACTIVE</name>
									<description>at least one interrupt status set.</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>LS2_OC_ICLR</name>
							<description>External Low Side 2 FET Over-current Status</description>
							<lsb>11</lsb>
							<msb>11</msb>
							<access>write-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>INACTIVE</name>
									<description>no interrupt status set.</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ACTIVE</name>
									<description>at least one interrupt status set.</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>LS1_OC_ICLR</name>
							<description>External Low Side 1 FET Over-current Status</description>
							<lsb>10</lsb>
							<msb>10</msb>
							<access>write-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>INACTIVE</name>
									<description>no interrupt status set.</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ACTIVE</name>
									<description>at least one interrupt status set.</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>HS3_DS_ICLR</name>
							<description>Bridge Driver High Side 3 Pre-Driver short Interrupt Status</description>
							<lsb>5</lsb>
							<msb>5</msb>
							<access>write-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>INACTIVE</name>
									<description>no interrupt status set</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ACTIVE</name>
									<description>interrupt status set</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>LS3_DS_ICLR</name>
							<description>Bridge Driver Low Side 3 Pre-Driver short Interrupt Status</description>
							<lsb>4</lsb>
							<msb>4</msb>
							<access>write-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>INACTIVE</name>
									<description>no interrupt status set</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ACTIVE</name>
									<description>interrupt status set</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>HS2_DS_ICLR</name>
							<description>Bridge Driver High Side 2 Pre-Driver short Interrupt Status</description>
							<lsb>3</lsb>
							<msb>3</msb>
							<access>write-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>INACTIVE</name>
									<description>no interrupt status set</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ACTIVE</name>
									<description>interrupt status set</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>HS1_DS_ICLR</name>
							<description>Bridge Driver High Side 1 Pre-Driver short Interrupt Status</description>
							<lsb>2</lsb>
							<msb>2</msb>
							<access>write-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>INACTIVE</name>
									<description>no interrupt status set</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ACTIVE</name>
									<description>interrupt status set</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>LS2_DS_ICLR</name>
							<description>Bridge Driver Low Side 2 Pre-Driver short Interrupt Status</description>
							<lsb>1</lsb>
							<msb>1</msb>
							<access>write-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>INACTIVE</name>
									<description>no interrupt status set</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ACTIVE</name>
									<description>interrupt status set</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>LS1_DS_ICLR</name>
							<description>Bridge Driver Low Side 1 Pre-Driver short Interrupt Status</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>write-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>INACTIVE</name>
									<description>no interrupt status set</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ACTIVE</name>
									<description>interrupt status set</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>BFSTS</name>
					<description>Bus Fault Status</description>
					<addressOffset>0x80</addressOffset>
					<size>32</size>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>SBFSTS</name>
							<description>System Bus Fault Status Valid Flag</description>
							<lsb>1</lsb>
							<msb>1</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>Valid</name>
									<description>Adress is valid</description>
									<value>0b1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>not_valid</name>
									<description>Adress is not valid</description>
									<value>0b0</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>DBFSTS</name>
							<description>Data Bus Fault Status Valid Flag</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>Valid</name>
									<description>Adress is valid</description>
									<value>0b1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>not_valid</name>
									<description>Adress is not valid</description>
									<value>0b0</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>BFSTS_CLR</name>
					<description>Bus Fault Status Clear Register</description>
					<addressOffset>0x8C</addressOffset>
					<size>32</size>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>SBFSTSCLR</name>
							<description>System Bus Fault Status Clear Flag</description>
							<lsb>1</lsb>
							<msb>1</msb>
							<access>write-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>Cleared</name>
									<description>Valid Adress is cleared</description>
									<value>0b1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>not_cleared</name>
									<description>Valid Adress is not cleared</description>
									<value>0b0</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>DBFSTSCLR</name>
							<description>Data Bus Fault Status Clear Flag</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>write-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>Cleared</name>
									<description>Adress is cleared</description>
									<value>0b1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>not_cleared</name>
									<description>Adress is not cleared</description>
									<value>0b0</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>DBFA</name>
					<description>Data Bus Fault Address Register</description>
					<addressOffset>0x84</addressOffset>
					<size>32</size>
					<resetValue>0x00000000</resetValue>
					<resetMask>0x00000000</resetMask>
					<fields>
						<field>
							<name>DBFA</name>
							<description>Data Bus Fault Address Register</description>
							<lsb>0</lsb>
							<msb>31</msb>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>PCU_CTRL_STS</name>
					<description>Power Control Unit Control Status</description>
					<addressOffset>0x30</addressOffset>
					<size>32</size>
					<resetValue>0x06E37EF3</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>CLKWDT_RES_SD_DIS</name>
							<description>Clock Watchdog Reset Disable</description>
							<lsb>26</lsb>
							<msb>26</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>Enable</name>
									<description>Clock Watchdog Reset Enable</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Disable</name>
									<description>Clock Watchdog Reset Disable</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>CLKLOSS_SD_DIS</name>
							<description>Power Switches Loss of Clock Shutdown Disable (AMCLK3)</description>
							<lsb>25</lsb>
							<msb>25</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>Enable</name>
									<description>Automatic Shutdown Signal for Power Switches in case of loss of clock</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Disable</name>
									<description>Automatic Shutdown Signal for Power Switches in case of loss of clock</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>SYS_OT_PS_DIS</name>
							<description>System Overtemperature Power Switches Shutdown Disable</description>
							<lsb>24</lsb>
							<msb>24</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>Enable</name>
									<description>Automatic Shutdown Signal for Power Switches in case of system overtemperature preenable</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Disable</name>
									<description>Automatic Shutdown Signal for Power Switches in case of system overtemperature enable</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>SYS_VSD_OV_SLM_DIS</name>
							<description>VSD Overvoltage Shutdown for Peripherals Disable</description>
							<lsb>14</lsb>
							<msb>14</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>Enable</name>
									<description>Automatic Shutdown for Power modules in case of VSD Overvoltage enabled</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Disable</name>
									<description>Automatic Shutdown for Power modules in case of VSD Overvoltage disabled</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>LIN_VS_UV_SD_DIS</name>
							<description>LIN Module VS Undervoltage Transmitter Shutdown</description>
							<lsb>8</lsb>
							<msb>8</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>Enable</name>
									<description>Automatic Shutdown for Power modules in case of VS Undervoltage enabled</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Disable</name>
									<description>Automatic Shutdown for Power modules in case of VS Undervoltage disabled</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>FAIL_PS_DIS</name>
							<description>Disable LIN, BDRV and CP because of Overtemperature</description>
							<lsb>7</lsb>
							<msb>7</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>Switch_off_Enabled</name>
									<description>LIN, BDRV and CP will be turned off when Overtemperature occurs</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Switch_off_Disabled</name>
									<description>LIN, BDRV and CP will be kept on when Overtemperature occurs</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>CLKWDT_SD_DIS</name>
							<description>Power Modules Clock Watchdog Shutdown Disable</description>
							<lsb>1</lsb>
							<msb>1</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>Shutdown_Enable</name>
									<description>Power Devices will be switched off when Clock Watchdog occurs</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Shutdown_Disable</name>
									<description>Power Devices will not be shutdown when Clock Watchog occurs</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
