cmsis-svd/cmsis-svd/data/Infineon/TLE9879-2.svd
				<register>
					<name>SYS_SUPPLY_IRQ_CLR</name>
					<description>System Supply Interrupt Status Clear</description>
					<addressOffset>0x24</addressOffset>
					<size>32</size>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>VDD1V5_OV_SCLR</name>
							<description>VDDC Overvoltage Status</description>
							<lsb>23</lsb>
							<msb>23</msb>
							<access>write-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>No_Overvoltage</name>
									<description>occurred</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Overvoltage</name>
									<description>occurred</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>VDD5V_OV_SCLR</name>
							<description>VDDP Overvoltage Status</description>
							<lsb>22</lsb>
							<msb>22</msb>
							<access>write-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>No_Overvoltage</name>
									<description>occurred</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Overvoltage</name>
									<description>occurred</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>VS_OV_SCLR</name>
							<description>VS Overvoltage Interrupt Status</description>
							<lsb>21</lsb>
							<msb>21</msb>
							<access>write-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>No_Overvoltage</name>
									<description>occurred</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Overvoltage</name>
									<description>occurred</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>MON_OV_SCLR</name>
							<description>MON Overvoltage Status</description>
							<lsb>20</lsb>
							<msb>20</msb>
							<access>write-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>No_Overvoltage</name>
									<description>occurred</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Overvoltage</name>
									<description>occurred</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>VDD1V5_UV_SCLR</name>
							<description>VDDC Undervoltage Status</description>
							<lsb>19</lsb>
							<msb>19</msb>
							<access>write-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>No_Undervoltage</name>
									<description>occurred</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Undervoltage</name>
									<description>occurred</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>VDD5V_UV_SCLR</name>
							<description>VDDP Undervoltage Status</description>
							<lsb>18</lsb>
							<msb>18</msb>
							<access>write-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>No_Undervoltage</name>
									<description>occurred</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Undervoltage</name>
									<description>occurred</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>VS_UV_SCLR</name>
							<description>VS Undervoltage Status</description>
							<lsb>17</lsb>
							<msb>17</msb>
							<access>write-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>No_Undervoltage</name>
									<description>occurred</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Undervoltage</name>
									<description>occurred</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>MON_UV_SCLR</name>
							<description>MON Undervoltage Status</description>
							<lsb>16</lsb>
							<msb>16</msb>
							<access>write-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>No_Undervoltage</name>
									<description>occurred</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Undervoltage</name>
									<description>occurred</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>VDD1V5_OV_ICLR</name>
							<description>VDDC Overvoltage Interrupt Status (ADC2 channel 3)</description>
							<lsb>7</lsb>
							<msb>7</msb>
							<access>write-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>No_Overvoltage_Interrupt</name>
									<description>occurred</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Overvoltage_Interrupt</name>
									<description>occurred</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>VDD5V_OV_ICLR</name>
							<description>VDDP Overvoltage Interrupt Status (ADC2 channel 2)</description>
							<lsb>6</lsb>
							<msb>6</msb>
							<access>write-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>No_Overvoltage_Interrupt</name>
									<description>occurred</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Overvoltage_Interrupt</name>
									<description>occurred</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>VS_OV_ICLR</name>
							<description>VS Overvoltage Interrupt Status (ADC2 channel 1)</description>
							<lsb>5</lsb>
							<msb>5</msb>
							<access>write-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>No_Overvoltage_Interrupt</name>
									<description>occurred</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Overvoltage_Interrupt</name>
									<description>occurred</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>MON_OV_ICLR</name>
							<description>MON Overvoltage Interrupt Status (ADC2 channel 4)</description>
							<lsb>4</lsb>
							<msb>4</msb>
							<access>write-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>No_Overvoltage_Interrupt</name>
									<description>occurred</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Overvoltage_Interrupt</name>
									<description>occurred</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>VDD1V5_UV_ICLR</name>
							<description>VDDC Undervoltage Interrupt Status (ADC2 channel 3)</description>
							<lsb>3</lsb>
							<msb>3</msb>
							<access>write-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>No_Undervoltage_Interrupt</name>
									<description>occurred</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Undervoltage_Interrupt</name>
									<description>occurred</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>VDD5V_UV_ICLR</name>
							<description>VDDP Undervoltage Interrupt Status (ADC2 channel 2)</description>
							<lsb>2</lsb>
							<msb>2</msb>
							<access>write-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>No_Undervoltage_Interrupt</name>
									<description>occurred</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Undervoltage_Interrupt</name>
									<description>occurred</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>VS_UV_ICLR</name>
							<description>VS Undervoltage Interrupt Status (ADC2 channel 1)</description>
							<lsb>1</lsb>
							<msb>1</msb>
							<access>write-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>No_Undervoltage_Interrupt</name>
									<description>occurred</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Undervoltage_Interrupt</name>
									<description>occurred</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>MON_UV_ICLR</name>
							<description>MON Undervoltage Interrupt Status (ADC2 channel 4)</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>write-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>No_Undervoltage_Interrupt</name>
									<description>occurred</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Undervoltage_Interrupt</name>
									<description>occurred</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>SYS_SUPPLY_IRQ_CTRL</name>
					<description>System Supply Interrupt Control</description>
					<addressOffset>0x20</addressOffset>
					<size>32</size>
					<resetValue>0x000000FF</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>VDD1V5_OV_IE</name>
							<description>VDD1V5 Overvoltage Interrupt Enable</description>
							<lsb>7</lsb>
							<msb>7</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>Interrupt is disabled</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>Interrupt is enabled</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>VDD5V_OV_IE</name>
							<description>VDD5V Overvoltage Interrupt Enable</description>
							<lsb>6</lsb>
							<msb>6</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>Interrupt is disabled</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>Interrupt is enabled</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>VS_OV_IE</name>
							<description>VS Overvoltage Interrupt Enable</description>
							<lsb>5</lsb>
							<msb>5</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>Interrupt is disabled</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>Interrupt is enabled</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>MON_OV_IE</name>
							<description>MON Overvoltage Interrupt Enable</description>
							<lsb>4</lsb>
							<msb>4</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>Interrupt is disabled</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>Interrupt is enabled</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>VDD1V5_UV_IE</name>
							<description>VDD1V5 Undervoltage Interrupt Enable</description>
							<lsb>3</lsb>
							<msb>3</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>Interrupt is disabled</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>Interrupt is enabled</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>VDD5V_UV_IE</name>
							<description>VDD5V Undervoltage Interrupt Enable</description>
							<lsb>2</lsb>
							<msb>2</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>Interrupt is disabled</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>Interrupt is enabled</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>VS_UV_IE</name>
							<description>VS Undervoltage Interrupt Enable</description>
							<lsb>1</lsb>
							<msb>1</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>Interrupt is disabled</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>Interrupt is enabled</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>MON_UV_IE</name>
							<description>MON Undervoltage Interrupt Enable</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>Interrupt is disabled</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>Interrupt is enabled</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
