cmsis-svd/cmsis-svd/data/Infineon/TLE9879-2.svd
			</registers>
		</peripheral>
		<peripheral>
			<name>UART1</name>
			<description>UART1 Module</description>
			<baseAddress>0x48020000</baseAddress>
			<addressBlock>
				<offset>0x0</offset>
				<size>0x2000</size>
				<usage>registers</usage>
			</addressBlock>
			<interrupt>
				<name>UART1_LIN_Tmr2_Int</name>
				<description>Interrupt node10: UART1(ASC,LIN), Timer2</description>
				<value>10</value>
			</interrupt>
			<registers>
				<register>
					<name>SBUF</name>
					<description>Serial Data Buffer</description>
					<addressOffset>0x04</addressOffset>
					<size>32</size>
					<resetValue>0x00</resetValue>
					<resetMask>0xFF</resetMask>
					<fields>
						<field>
							<name>VAL</name>
							<description>Serial Interface Buffer Register</description>
							<lsb>0</lsb>
							<msb>7</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>SCON</name>
					<description>Serial Channel Control Register</description>
					<addressOffset>0x00</addressOffset>
					<size>32</size>
					<resetValue>0x00</resetValue>
					<resetMask>0xFF</resetMask>
					<fields>
						<field>
							<name>RI</name>
							<description>Receive Interrupt Flag</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>TI</name>
							<description>Transmit Interrupt Flag</description>
							<lsb>1</lsb>
							<msb>1</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>RB8</name>
							<description>Serial Port Receiver Bit 9</description>
							<lsb>2</lsb>
							<msb>2</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>TB8</name>
							<description>Serial Port Transmitter Bit 9</description>
							<lsb>3</lsb>
							<msb>3</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>REN</name>
							<description>Enable Receiver of Serial Port</description>
							<lsb>4</lsb>
							<msb>4</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>Serial reception is disabled.</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>Serial reception is enabled.</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>SM2</name>
							<description>Enable Serial Port Multiprocessor Communication in Modes 2 and 3</description>
							<lsb>5</lsb>
							<msb>5</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>SM1_SM0</name>
							<description>Serial Port Operating Mode Selection</description>
							<lsb>6</lsb>
							<msb>7</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>Mode 0: 8-bit shift register, fixed baud rate (fPCLK/2).</description>
									<value>0b00</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>Mode 1: 8-bit UART, variable baud rate.</description>
									<value>0b01</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value3</name>
									<description>Mode 2: 9-bit UART, fixed baud rate (fPCLK/64 or fPCLK/32).</description>
									<value>0b10</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value4</name>
									<description>Mode 3: 9-bit UART, variable baud rate.</description>
									<value>0b11</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>SCONCLR</name>
					<description>Serial Channel Control Clear Register</description>
					<addressOffset>0x08</addressOffset>
					<size>32</size>
					<resetValue>0x00</resetValue>
					<resetMask>0xFF</resetMask>
					<fields>
						<field>
							<name>RICLR</name>
							<description>Receive Interrupt Clear Flag</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>TICLR</name>
							<description>Transmit Interrupt Clear Flag</description>
							<lsb>1</lsb>
							<msb>1</msb>
							<access>write-only</access>
						</field>
					</fields>
				</register>
			</registers>
		</peripheral>
		<peripheral>
			<name>UART2</name>
			<description>UART2 Module</description>
			<baseAddress>0x48022000</baseAddress>
			<addressBlock>
				<offset>0x0</offset>
				<size>0x2000</size>
				<usage>registers</usage>
			</addressBlock>
			<interrupt>
				<name>UART2_Tmr21_EINT2_Int</name>
				<description>Interrupt node11: UART2, Timer21, EINT2</description>
				<value>11</value>
			</interrupt>
			<registers>
				<register>
					<name>SBUF</name>
					<description>Serial Data Buffer</description>
					<addressOffset>0x04</addressOffset>
					<size>32</size>
					<resetValue>0x00</resetValue>
					<resetMask>0xFF</resetMask>
					<fields>
						<field>
							<name>VAL</name>
							<description>Serial Interface Buffer Register</description>
							<lsb>0</lsb>
							<msb>7</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>SCON</name>
					<description>Serial Channel Control Register</description>
					<addressOffset>0x00</addressOffset>
					<size>32</size>
					<resetValue>0x00</resetValue>
					<resetMask>0xFF</resetMask>
					<fields>
						<field>
							<name>RI</name>
							<description>Receive Interrupt Flag</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>TI</name>
							<description>Transmit Interrupt Flag</description>
							<lsb>1</lsb>
							<msb>1</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>RB8</name>
							<description>Serial Port Receiver Bit 9</description>
							<lsb>2</lsb>
							<msb>2</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>TB8</name>
							<description>Serial Port Transmitter Bit 9</description>
							<lsb>3</lsb>
							<msb>3</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>REN</name>
							<description>Enable Receiver of Serial Port</description>
							<lsb>4</lsb>
							<msb>4</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>Serial reception is disabled.</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>Serial reception is enabled.</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>SM2</name>
							<description>Enable Serial Port Multiprocessor Communication in Modes 2 and 3</description>
							<lsb>5</lsb>
							<msb>5</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>SM1_SM0</name>
							<description>Serial Port Operating Mode Selection</description>
							<lsb>6</lsb>
							<msb>7</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>Mode 0: 8-bit shift register, fixed baud rate (fPCLK/2).</description>
									<value>0b00</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>Mode 1: 8-bit UART, variable baud rate.</description>
									<value>0b01</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value3</name>
									<description>Mode 2: 9-bit UART, fixed baud rate (fPCLK/64 or fPCLK/32).</description>
									<value>0b10</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value4</name>
									<description>Mode 3: 9-bit UART, variable baud rate.</description>
									<value>0b11</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>SCONCLR</name>
					<description>Serial Channel Control Clear Register</description>
					<addressOffset>0x08</addressOffset>
					<size>32</size>
					<resetValue>0x00</resetValue>
					<resetMask>0xFF</resetMask>
					<fields>
						<field>
							<name>RICLR</name>
							<description>Receive Interrupt Clear Flag</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>TICLR</name>
							<description>Transmit Interrupt Clear Flag</description>
							<lsb>1</lsb>
							<msb>1</msb>
							<access>write-only</access>
						</field>
					</fields>
				</register>
			</registers>
		</peripheral>
	</peripherals>
</device>
